{
  "Immunopathology Basics (Dolen)": {
    "Gell & Coombs Hypersensitivity Types": [
      {
        "stem": "A 28-year-old man presents to the emergency department with sudden onset of widespread hives, facial swelling, and difficulty breathing after eating a peanut butter sandwich. His blood pressure is 80/40 mmHg. This clinical presentation is most consistent with which type of Gell & Coombs hypersensitivity reaction?",
        "options": {
          "A": "Type I",
          "B": "Type II",
          "C": "Type III",
          "D": "Type IV",
          "E": "Type V"
        },
        "answer": "A",
        "rationales": {
          "A": "Type I hypersensitivity, also known as IgE-mediated immediate hypersensitivity, is characterized by conditions like rhinitis, asthma, atopic dermatitis, and anaphylaxis. The patient's symptoms of sudden widespread hives, facial swelling, difficulty breathing, and hypotension are classic signs of anaphylaxis, a severe, systemic Type I reaction.",
          "B": "Type II hypersensitivity involves IgG (or IgM) antibodies binding to antigens on cell surfaces, leading to cytotoxic effects (e.g., drug-induced hemolysis) or stimulatory/inhibitory reactions (e.g., Graves' disease, myasthenia gravis). This does not match the acute systemic allergic reaction described.",
          "C": "Type III hypersensitivity is characterized by IgG (or IgM) immune complex reactions, where antigen-antibody complexes deposit in tissues, causing conditions like serum sickness or Arthus reactions. The patient's symptoms are too immediate and systemic for a typical immune complex reaction.",
          "D": "Type IV hypersensitivity is a T-cell mediated delayed hypersensitivity response, involving effector T cells and macrophages, as seen in contact dermatitis or tuberculin sensitivity. This is a delayed reaction and does not manifest with immediate anaphylaxis.",
          "E": "Type V is an older, colloquial term sometimes used for stimulatory Type II reactions, which is now generally classified under Type II."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A 6-year-old boy develops a widespread erythematous, pruritic rash with blistering three days after starting a new topical antibiotic for a skin infection. He has no other systemic symptoms. Which of the following immunologic mechanisms is most likely responsible for this reaction?",
        "options": {
          "A": "IgE-mediated mast cell degranulation",
          "B": "IgG-mediated cytotoxicity against skin cells",
          "C": "Deposition of antigen-antibody complexes in the dermal capillaries",
          "D": "T-cell mediated delayed hypersensitivity",
          "E": "Autoantibody stimulation of cell surface receptors"
        },
        "answer": "D",
        "rationales": {
          "A": "IgE-mediated mast cell degranulation (Type I hypersensitivity) causes immediate reactions such as hives, angioedema, or anaphylaxis, not a delayed blistering rash.",
          "B": "IgG-mediated cytotoxicity against skin cells (Type II hypersensitivity) would typically result in cell lysis or damage by complement or phagocytosis, often seen in drug-induced hemolytic anemia or some bullous skin diseases, but usually with a different time course or presentation than contact dermatitis.",
          "C": "Deposition of antigen-antibody complexes in the dermal capillaries (Type III hypersensitivity) can cause vasculitis, presenting as palpable purpura, which is different from the described blistering rash and typically has a slightly different time course.",
          "D": "T-cell mediated delayed hypersensitivity (Type IV) reactions typically occur 1-3 days after antigen contact and involve effector T cells and macrophages. Contact dermatitis, characterized by an erythematous, pruritic, and blistering rash, is a classic example of a Type IV hypersensitivity reaction. The 3-day delay in symptom onset is highly characteristic of this type.",
          "E": "Autoantibody stimulation of cell surface receptors is a subtype of Type II hypersensitivity (sometimes called Type V), seen in conditions like Graves' disease or myasthenia gravis, and does not fit the described skin reaction."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A mother brings her 4-year-old child to the clinic concerned about recurrent episodes of eczema, asthma, and seasonal rhinitis. She mentions that she and her husband both have a history of seasonal allergies. This familial predisposition to develop IgE-mediated reactions to common environmental allergens is best described by which of the following terms?",
        "options": {
          "A": "Anaphylaxis",
          "B": "Hypersensitivity",
          "C": "Atopy",
          "D": "Immunodeficiency",
          "E": "Autoimmunity"
        },
        "answer": "C",
        "rationales": {
          "A": "Anaphylaxis is a severe, systemic IgE-mediated (Type I) allergic reaction, not a term for genetic predisposition.",
          "B": "Hypersensitivity is a broader term referring to exaggerated or inappropriate immune responses, which can be IgE-mediated or involve other mechanisms (Type II, III, IV). It describes the mechanism but not the genetic predisposition.",
          "C": "Atopy describes a genetic predisposition to develop IgE-mediated reactions to common environmental allergens. Diseases where symptoms can be triggered by allergic (Type I) mechanisms, other immunologic mechanisms, or non-immunologic mechanisms are often called \"allergic diseases\" or \"atopic diseases\" and tend to be inherited together (e.g., rhinitis, asthma, atopic dermatitis). The child's constellation of eczema, asthma, and rhinitis, coupled with a family history of allergies, strongly suggests atopy.",
          "D": "Immunodeficiency refers to a weakened immune system, leading to increased susceptibility to infections, which is not what is described here.",
          "E": "Autoimmunity refers to the immune system attacking self-components, which is also not the primary concept described."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient describes experiencing gastrointestinal distress, bloating, and diarrhea after consuming milk products, which they refer to as a \"milk allergy.\" However, IgE testing for milk proteins is negative. Which of the following statements best clarifies the semantic confusion regarding the patient's use of the term \"allergy\" in this context?",
        "options": {
          "A": "\"Allergy\" universally refers to any adverse reaction to a substance.",
          "B": "An \"allergy\" specifically denotes an IgE-dependent Type I immediate hypersensitivity mechanism.",
          "C": "The patient's symptoms indicate a Type IV hypersensitivity, which is also called an allergy.",
          "D": "\"Atopy\" is a synonym for \"allergy\" and can encompass all adverse food reactions.",
          "E": "\"Allergy\" is a broad term that includes both immunologic and non-immunologic adverse reactions."
        },
        "answer": "B",
        "rationales": {
          "A": "The lay public often uses \"allergy\" to refer to any adverse reaction, but in a precise medical context, it is much more specific.",
          "B": "'Allergy' is a very specific disease mechanism: IgE-dependent Type I immediate hypersensitivity, not a disease and not a diagnosis. The patient's negative IgE test for milk proteins indicates that their adverse reaction is not an IgE-mediated Type I hypersensitivity, even though they refer to it as an \"allergy.\" Lactose intolerance, for example, is a common non-immunologic adverse reaction to milk.",
          "C": "While Type IV hypersensitivity (e.g., contact dermatitis) is an immunologic reaction, it is distinct from Type I IgE-mediated allergy and is not what is typically implied by \"milk allergy\" from a food perspective, nor is it the mechanism for immediate food intolerance.",
          "D": "Atopy describes a genetic predisposition to develop IgE-mediated reactions, but it is not a synonym for allergy and does not encompass all adverse food reactions, especially non-immunologic ones.",
          "E": "In common usage, \"allergy\" is often used broadly, but in precise medical terminology, especially by US allergists, it refers specifically to IgE-mediated reactions. The question asks to clarify the semantic confusion from a precise medical standpoint."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A 34-year-old woman with a history of severe allergic rhinitis experiences sneezing, nasal congestion, and itching immediately after exposure to cat dander. Which of the following immune cell receptors is primarily responsible for initiating the rapid release of mediators in response to the allergen?",
        "options": {
          "A": "FcγRII receptor",
          "B": "FcεRI high-affinity IgE receptor",
          "C": "Toll-like receptor 4 (TLR4)",
          "D": "Complement receptor 1 (CR1)",
          "E": "CD40 receptor"
        },
        "answer": "B",
        "rationales": {
          "A": "FcγRII receptors bind the Fc portion of IgG and are involved in inhibitory signaling on various immune cells, not in the primary activation of mast cells by IgE and allergen.",
          "B": "The FcεRI high-affinity IgE receptor is found on mast cells, basophils, and activated eosinophils. When allergens (like cat dander) cross-link IgE antibodies bound to these receptors, it triggers receptor aggregation and activation, leading to the rapid release of mediators such as histamine and leukotrienes, which cause immediate allergic symptoms like sneezing and itching.",
          "C": "Toll-like receptors (TLRs), such as TLR4, recognize pathogen-associated molecular patterns (PAMPs) and initiate innate immune responses, not specific allergic reactions to allergens.",
          "D": "Complement receptor 1 (CR1) binds complement components and is involved in the clearance of immune complexes and pathogen opsonization, not direct allergen-induced mast cell activation.",
          "E": "CD40 receptor is found on B cells and other cells and plays a role in B cell activation and class switching upon binding to CD40 ligand on T cells. It is not directly involved in mast cell activation in allergic reactions."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A 32-year-old man develops a painful, blistering rash and joint swelling a week after starting a new antibiotic for a skin infection. Examination reveals generalized urticaria and polyarthralgia. Lab tests show elevated inflammatory markers. This clinical presentation is most consistent with which type of hypersensitivity reaction?",
        "options": {
          "A": "Type I",
          "B": "Type II",
          "C": "Type III",
          "D": "Type IV",
          "E": "Type V"
        },
        "answer": "C",
        "rationales": {
          "C": "Serum sickness is a classic Type III hypersensitivity, caused by IgG/IgM immune complex deposition leading to inflammation. The patient’s delayed rash, arthritis, and urticaria match this mechanism.",
          "A": "Type I is IgE-mediated immediate hypersensitivity (minutes–hours), not delayed serum sickness.",
          "B": "Type II involves antibody-mediated cytotoxicity (e.g., hemolytic anemia), not systemic rash/arthritis.",
          "D": "Type IV is T cell–mediated (e.g., contact dermatitis), not systemic urticaria and arthritis.",
          "E": "Type V is a non-standard extension of Type II, not recognized in the core 4-type classification."
        },
        "long_form": true
      }
    ],
    "Concepts of Allergy and Atopy": [
      {
        "stem": "Which of the following statements best defines 'allergy' in the context of specific disease mechanisms, as per most US allergists?",
        "options": {
          "A": "Any adverse reaction to a substance.",
          "B": "A disease characterized by the presence of eosinophils.",
          "C": "A Type IV T-cell mediated hypersensitivity response.",
          "D": "An IgE-dependent Type I immediate hypersensitivity mechanism.",
          "E": "A genetic predisposition to develop IgE-mediated reactions to common environmental allergens."
        },
        "answer": "D",
        "rationales": {
          "D": "Allergy = IgE-mediated Type I immediate hypersensitivity. This mechanistic definition is used clinically by allergists.",
          "A": "Lay usage, not immunologically precise.",
          "B": "Eosinophilia occurs in many allergic conditions but is not the definition.",
          "C": "This describes delayed hypersensitivity, not allergy.",
          "E": "That describes atopy, not allergy itself."
        },
        "long_form": true
      }
    ],
    "Mast Cell Activation and Mediator Release": [
      {
        "stem": "A 28-year-old woman presents with acute onset of generalized urticaria, wheezing, and hypotension after consuming a seafood dish. Which of the following is a clinically useful biomarker specifically indicative of mast cell activation, but not released by basophils?",
        "options": {
          "A": "Histamine",
          "B": "Leukotrienes",
          "C": "Tryptase",
          "D": "Prostaglandins",
          "E": "Immunoglobulin E (IgE)"
        },
        "answer": "C",
        "rationales": {
          "C": "Tryptase is mast cell–specific and not present in basophils, making it a key biomarker of mast cell activation.",
          "A": "Histamine is released by both mast cells and basophils.",
          "B": "Leukotrienes are made by mast cells but are not unique biomarkers.",
          "D": "Prostaglandins are inflammatory mediators, not mast cell–specific.",
          "E": "IgE is an antibody that binds mast cells but is not released during activation."
        },
        "long_form": true
      }
    ],
    "Mediators of Hypersensitivity": [
      {
        "stem": "A 10-year-old boy with asthma experiences bronchospasm and mucus secretion after exposure to cat dander. Which mediator, synthesized upon mast cell activation, primarily contributes to these symptoms by binding to CysLT1 receptors?",
        "options": {
          "A": "Histamine",
          "B": "Tryptase",
          "C": "Leukotrienes",
          "D": "Cytokines",
          "E": "Immunoglobulin E (IgE)"
        },
        "answer": "C",
        "rationales": {
          "C": "Leukotrienes bind CysLT1 receptors and cause bronchospasm + mucus secretion.",
          "A": "Histamine causes itching, sneezing, and vascular leakage but not the key mucus/CysLT1 effect.",
          "B": "Tryptase is a biomarker, not the mediator here.",
          "D": "Cytokines recruit cells, but do not cause acute bronchospasm/mucus.",
          "E": "IgE triggers mast cells but is not a mediator released in the reaction."
        },
        "long_form": true
      }
    ],
    "Therapeutic Interventions": [
      {
        "stem": "Which therapeutic intervention for allergic diseases directly targets and binds to IgE, preventing its interaction with mast cell receptors?",
        "options": {
          "A": "Corticosteroids",
          "B": "H1 antihistamines",
          "C": "Leukotriene receptor antagonists",
          "D": "Omalizumab",
          "E": "Tezepelumab"
        },
        "answer": "D",
        "rationales": {
          "D": "Omalizumab is an anti-IgE monoclonal antibody that prevents mast cell activation.",
          "A": "Corticosteroids broadly suppress inflammation, not IgE specifically.",
          "B": "H1 blockers block histamine effects, not IgE binding.",
          "C": "Leukotriene antagonists block receptors, not IgE.",
          "E": "Tezepelumab blocks TSLP, not IgE."
        },
        "long_form": true
      }
    ]
  },
  "Immunosuppressants (Su)": {
    "Glucocorticoids": [
      {
        "stem": "A 45-year-old woman is prescribed a high dose of prednisone for an autoimmune flare. Her physician counsels her on potential side effects. Which of the following is a classic and common adverse effect associated with long-term glucocorticoid use?",
        "options": {
          "A": "Nephrotoxicity",
          "B": "Bone marrow suppression",
          "C": "Myositis",
          "D": "\"Moon facies\"",
          "E": "Peripheral neuropathy"
        },
        "answer": "D",
        "rationales": {
          "A": "Nephrotoxicity (renal dysfunction) is a major side effect of calcineurin inhibitors like cyclosporine and tacrolimus, not typically glucocorticoids.",
          "B": "Bone marrow suppression is a common side effect of antiproliferative and antimetabolic drugs (e.g., mycophenolate mofetil, azathioprine, methotrexate, cyclophosphamide), and also ganciclovir. While glucocorticoids can affect leukocyte counts, profound bone marrow suppression is not their primary hematologic toxicity.",
          "C": "Myositis (inflammation of muscle) can occur, but CPK increase leading to myositis is more specifically associated with dolutegravir (an INSTI).",
          "D": "\"Moon facies\" (a round, full face) is a classic clinical manifestation of iatrogenic Cushing's syndrome, a common and significant adverse effect associated with long-term glucocorticoid use. Other features include central obesity, \"buffalo hump,\" skin thinning, and striae.",
          "E": "Peripheral neuropathy is a side effect associated with some older NRTIs like stavudine or didanosine, not typically glucocorticoids."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient with a history of systemic lupus erythematosus is treated with oral prednisone. The therapeutic effect of prednisone is primarily achieved by which of the following mechanisms?",
        "options": {
          "A": "Inhibiting calcineurin, thereby preventing NFAT pathway activation.",
          "B": "Directly cross-linking DNA and RNA, leading to lymphocyte cell death.",
          "C": "Binding to nuclear receptors, which leads to transactivation of anti-inflammatory genes and transrepression of pro-inflammatory genes.",
          "D": "Blocking specific cytokine receptors, such as IL-2, to reduce lymphocyte proliferation.",
          "E": "Acting as a fraudulent nucleotide, preventing gene transcription in lymphocytes."
        },
        "answer": "C",
        "rationales": {
          "A": "Inhibiting calcineurin and preventing NFAT pathway activation is the mechanism of calcineurin inhibitors (cyclosporine, tacrolimus).",
          "B": "Directly cross-linking DNA and RNA, leading to lymphocyte cell death, is the mechanism of alkylating agents like cyclophosphamide.",
          "C": "Glucocorticoids, like prednisone, exert their immunosuppressive effects by binding to nuclear receptors. This binding leads to both transactivation (upregulation of anti-inflammatory genes) and transrepression (downregulation of pro-inflammatory genes), ultimately decreasing the cell cycle of activated lymphocytes and reducing the production of inflammatory mediators.",
          "D": "Blocking specific cytokine receptors is a mechanism of some monoclonal antibodies (e.g., benralizumab targets IL-5 receptor), not glucocorticoids.",
          "E": "Acting as a fraudulent nucleotide and preventing gene transcription is the mechanism of azathioprine, an antiproliferative drug."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A patient undergoing a renal transplant is prescribed cyclosporine to prevent graft rejection. Which of the following severe adverse effects requires careful monitoring in patients taking cyclosporine or tacrolimus?",
        "options": {
          "A": "Bone marrow suppression",
          "B": "Hepatitis",
          "C": "Nephrotoxicity",
          "D": "Lipoatrophy",
          "E": "Bronchospasm"
        },
        "answer": "C",
        "rationales": {
          "A": "Bone marrow suppression is a prominent side effect of antiproliferative and antimetabolic drugs (e.g., mycophenolate mofetil, azathioprine, methotrexate, cyclophosphamide), and ganciclovir, not primarily calcineurin inhibitors.",
          "B": "Hepatitis can be caused by various drugs, including some antiretrovirals, but it is not the most characteristic severe toxicity of calcineurin inhibitors.",
          "C": "Nephrotoxicity (renal dysfunction) is a major and well-known side effect of calcineurin inhibitors such as cyclosporine and tacrolimus. Close monitoring of renal function is essential for patients on these medications.",
          "D": "Lipoatrophy is a side effect associated with older nucleoside reverse transcriptase inhibitors (NRTIs) used in HIV treatment.",
          "E": "Bronchospasm is a specific toxicity of the anti-influenza drug zanamivir."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A 38-year-old man with uveitis unresponsive to methotrexate is started on cyclosporine. The primary mechanism by which cyclosporine exerts its immunosuppressive effect is by inhibiting which of the following?",
        "options": {
          "A": "Inosine monophosphate dehydrogenase, affecting lymphocyte cell cycle.",
          "B": "Dihydrofolate reductase, blocking nucleotide synthesis.",
          "C": "mTOR, leading to reduced lymphocyte proliferation.",
          "D": "Calcineurin, which prevents the dephosphorylation of NFAT.",
          "E": "DNA and RNA cross-linking, causing lymphocyte cell death."
        },
        "answer": "D",
        "rationales": {
          "A": "Inhibiting inosine monophosphate dehydrogenase is the mechanism of mycophenolate mofetil.",
          "B": "Inhibiting dihydrofolate reductase is the mechanism of methotrexate.",
          "C": "Inhibiting mTOR (mammalian target of rapamycin) is the mechanism of sirolimus and everolimus.",
          "D": "Calcineurin inhibitors, such as cyclosporine and tacrolimus, work by inhibiting calcineurin and the NFAT (Nuclear Factor of Activated T cells) pathway. This action reduces the cell cycle progression of activated lymphocytes and decreases the production of lymphokines (cytokines) crucial for immune responses.",
          "E": "Cross-linking DNA and RNA, leading to lymphocyte cell death, is the mechanism of alkylating agents like cyclophosphamide."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A patient with rheumatoid arthritis is prescribed methotrexate. Which of the following is the primary mechanism of action of methotrexate as an immunosuppressant?",
        "options": {
          "A": "Inhibits calcineurin.",
          "B": "Blocks the interaction of CD2 with LFA-3.",
          "C": "Acts as a folic acid antagonist.",
          "D": "Inhibits reverse transcriptase.",
          "E": "Induces cytotoxicity of lymphocytes by binding to CD3."
        },
        "answer": "C",
        "rationales": {
          "A": "Inhibits calcineurin is the mechanism of cyclosporine and tacrolimus.",
          "B": "Blocks the interaction of CD2 with LFA-3 is the mechanism of alefacept.",
          "C": "Methotrexate is a folic acid antagonist, which inhibits dihydrofolate reductase and consequently interferes with lymphocyte proliferation. This leads to its immunosuppressive effects.",
          "D": "Inhibits reverse transcriptase is the mechanism of NRTIs and NNRTIs in HIV treatment.",
          "E": "Induces cytotoxicity of lymphocytes by binding to CD3 is the mechanism of muromonab-CD3 (OKT3)."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient undergoing treatment for systemic lupus erythematosus develops severe myelosuppression and gastrointestinal upset. They are currently taking mycophenolate mofetil. This drug primarily exerts its immunosuppressive effect by:?",
        "options": {
          "A": "Alkylating macromolecules, leading to lymphocyte cell death.",
          "B": "Inhibiting inosine monophosphate dehydrogenase, thereby reducing guanine nucleotide synthesis.",
          "C": "Mimicking pyrophosphate, blocking viral DNA polymerase activity.",
          "D": "Preventing the dephosphorylation of NFAT, impacting cytokine production.",
          "E": "Activating BCL2, thus preventing apoptosis of lymphocytes."
        },
        "answer": "B",
        "rationales": {
          "A": "Alkylating macromolecules and leading to lymphocyte cell death is the mechanism of cyclophosphamide.",
          "B": "Mycophenolate mofetil inhibits inosine monophosphate dehydrogenase, an enzyme critical for the de novo synthesis of guanine nucleotides, which are essential for lymphocyte proliferation. This selectively affects lymphocytes more than other cell types because lymphocytes rely heavily on this pathway. Common side effects include bone marrow suppression and gastrointestinal issues.",
          "C": "Mimicking pyrophosphate and blocking viral DNA polymerase is the mechanism of foscarnet, an antiviral agent.",
          "D": "Preventing the dephosphorylation of NFAT is how calcineurin inhibitors (cyclosporine, tacrolimus) work.",
          "E": "Activating BCL2 to prevent apoptosis is a mechanism used by some oncogenic viruses (e.g., EBV's LMP-1, HHV-8's BCL2 analogue) to promote cell survival, not a direct immunosuppressive drug mechanism."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A kidney transplant recipient develops acute rejection. To rapidly deplete T cells and prevent further damage, the patient is administered Antithymocyte Globulin (ATG). What is the primary mechanism of action of ATG?",
        "options": {
          "A": "Binds to CD2, inhibiting T cell activation.",
          "B": "Recognizes multiple antigens on T lymphocytes, activating cytotoxicity against them.",
          "C": "Blocks TNFα and TNFβ, reducing inflammatory responses.",
          "D": "Neutralizes IgE antibodies, preventing mast cell degranulation.",
          "E": "Inhibits the calcineurin pathway, preventing T cell cytokine production."
        },
        "answer": "B",
        "rationales": {
          "A": "Binding to CD2 and inhibiting T cell activation is the mechanism of alefacept.",
          "B": "Antithymocyte globulin (ATG) is a polyclonal antibody derived from horses or rabbits that recognizes multiple antigens on the surface of T lymphocytes (e.g., CD2, CD3, CD4, CD8, HLA class I & II). Its mechanism involves activating cytotoxicity (complement- and cell-mediated) against lymphocytes and blocking their function, leading to rapid T cell depletion.",
          "C": "Blocking TNFα and TNFβ is the mechanism of TNF blockers, used in rheumatoid arthritis.",
          "D": "Neutralizing IgE antibodies is the mechanism of omalizumab, used for severe asthma and urticaria.",
          "E": "Inhibiting the calcineurin pathway is the mechanism of calcineurin inhibitors like cyclosporine and tacrolimus."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient receiving Muromonab-CD3 (OKT3) for acute allograft rejection develops high fever, chills, headache, and myalgia shortly after the infusion. This constellation of symptoms is characteristic of which of the following adverse effects?",
        "options": {
          "A": "Hypersensitivity reaction",
          "B": "Bone marrow suppression",
          "C": "Cytokine release syndrome",
          "D": "Nephrotoxicity",
          "E": "Opportunistic infection"
        },
        "answer": "C",
        "rationales": {
          "A": "While hypersensitivity (HAMA reaction) is a potential side effect of Muromonab-CD3, the constellation of symptoms described is more specific to cytokine release syndrome.",
          "B": "Bone marrow suppression is not a primary or immediate side effect of Muromonab-CD3.",
          "C": "Muromonab-CD3 (OKT3) is a murine monoclonal antibody that recognizes human CD3 on T cells, rapidly depleting them. Its side effects include a prominent cytokine release syndrome, characterized by high fever, chills/rigor, headache, tremor, nausea/vomiting, diarrhea, abdominal pain, and malaise. This occurs due to the rapid release of inflammatory cytokines from activated T cells as they are targeted by the antibody.",
          "D": "Nephrotoxicity is not a characteristic side effect of Muromonab-CD3; it is more associated with calcineurin inhibitors.",
          "E": "Opportunistic infections are a long-term risk due to the profound immunosuppression caused by Muromonab-CD3, but not an acute reaction during the infusion."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A 55-year-old woman receives high-dose prednisone for acute graft-versus-host disease after a bone marrow transplant. After several weeks, she develops a rounded face, increased fat deposition around her neck and abdomen, and elevated blood glucose levels. Which of the following is the primary mechanism by which prednisone exerts its immunosuppressive effects?",
        "options": {
          "A": "Inhibition of calcineurin, reducing lymphokine production.",
          "B": "Alkylation of DNA, leading to lymphocyte cell death.",
          "C": "Binding to nuclear receptors, downregulating pro-inflammatory genes.",
          "D": "Inhibition of inosine monophosphate dehydrogenase, impacting lymphocyte cell cycle.",
          "E": "Binding to CD3 on T cells, leading to rapid T cell depletion."
        },
        "answer": "C",
        "rationales": {
          "C": "Glucocorticoids bind nuclear receptors → upregulate anti-inflammatory genes + downregulate pro-inflammatory genes. They also slow lymphocyte proliferation. The side effects described are classic iatrogenic Cushing’s.",
          "A": "Mechanism of calcineurin inhibitors (e.g., cyclosporine, tacrolimus).",
          "B": "Mechanism of cyclophosphamide (alkylating agent).",
          "D": "Mechanism of mycophenolate mofetil.",
          "E": "Mechanism of muromonab-CD3 (OKT3)."
        },
        "long_form": true
      }
    ],
    "Calcineurin Inhibitors": [
      {
        "stem": "A 45-year-old man who underwent a kidney transplant 3 months ago is maintained on cyclosporine. He presents with new-onset hypertension and a tremor. Lab tests reveal elevated serum creatinine. Which of the following is the most significant adverse effect associated with calcineurin inhibitors like cyclosporine?",
        "options": {
          "A": "Bone marrow suppression",
          "B": "Lipodystrophy",
          "C": "Nephrotoxicity",
          "D": "Cytokine release syndrome",
          "E": "Peripheral neuropathy"
        },
        "answer": "C",
        "rationales": {
          "C": "Nephrotoxicity is the hallmark adverse effect of calcineurin inhibitors (cyclosporine, tacrolimus). Hypertension and tremor also fit this toxicity profile.",
          "A": "More associated with mycophenolate, azathioprine, or sirolimus.",
          "B": "Adverse effect of HIV protease inhibitors.",
          "D": "Adverse effect of muromonab-CD3 (OKT3).",
          "E": "Seen with older NRTIs; calcineurin inhibitors cause tremor instead."
        },
        "long_form": true
      }
    ],
    "Antiproliferative and Antimetabolic Drugs": [
      {
        "stem": "A 60-year-old woman with rheumatoid arthritis unresponsive to methotrexate is started on azathioprine. Her physician explains that this medication works by interfering with lymphocyte proliferation. Which of the following best describes the mechanism of action of azathioprine?",
        "options": {
          "A": "It inhibits mTOR, reducing lymphocyte cell cycle.",
          "B": "It is converted to fraudulent nucleotides that prevent gene transcription.",
          "C": "It acts as a folic acid antagonist, inhibiting dihydrofolate reductase.",
          "D": "It cross-links DNA/RNA/proteins, leading to lymphocyte cell death.",
          "E": "It inhibits inosine monophosphate dehydrogenase."
        },
        "answer": "B",
        "rationales": {
          "B": "Azathioprine is converted to 6-thioguanine nucleotides → incorporated into DNA → halt gene transcription and proliferation.",
          "A": "Mechanism of sirolimus/everolimus.",
          "C": "Mechanism of methotrexate.",
          "D": "Mechanism of cyclophosphamide.",
          "E": "Mechanism of mycophenolate mofetil."
        },
        "long_form": true
      }
    ],
    "Polyclonal and Monoclonal Antibodies": [
      {
        "stem": "A 50-year-old patient undergoing treatment for acute allograft rejection receives a murine monoclonal antibody that targets the CD3 molecule on T cells. Which of the following adverse effects is most specifically associated with this particular agent due to its murine origin and mechanism of action?",
        "options": {
          "A": "Dose-dependent nephrotoxicity",
          "B": "Hyperlipidemia and bone marrow suppression",
          "C": "Cytokine release syndrome",
          "D": "Hypersensitivity reaction due to HLA-B*5701 allele",
          "E": "Crystalluria and renal failure"
        },
        "answer": "C",
        "rationales": {
          "C": "Muromonab-CD3 (OKT3) causes cytokine release syndrome (fever, chills, GI upset) and anti-mouse antibody reactions.",
          "A": "Seen with calcineurin inhibitors and cidofovir.",
          "B": "Seen with sirolimus/everolimus.",
          "D": "Classic for abacavir hypersensitivity.",
          "E": "Seen with acyclovir/ganciclovir."
        },
        "long_form": true
      }
    ]
  },
  "Introduction to Inborn Errors of Immunity (Dolen)": {
    "Clinical Warning Signs of IEIs": [
      {
        "stem": "The parents of a 9-month-old infant bring their child to the pediatrician with concerns about frequent illnesses. The infant has had 5 ear infections in the past 6 months, required two courses of intravenous antibiotics for pneumonia, and has persistent thrush in the mouth despite antifungal treatment. Which of the following warning signs for Inborn Errors of Immunity (IEIs) is NOT present in this clinical vignette?",
        "options": {
          "A": "≥4 new ear infections in a year",
          "B": "≥2 pneumonias in 1 year",
          "C": "Persistent thrush, or fungal skin infection",
          "D": "Failure to thrive in an infant",
          "E": "Need for IV antibiotics to treat infections"
        },
        "answer": "D",
        "rationales": {
          "A": "≥4 new ear infections in a year: The infant has had 5 ear infections in the past 6 months, which meets this criterion.",
          "B": "≥2 pneumonias in 1 year: The infant required two courses of intravenous antibiotics for pneumonia, meeting this criterion.",
          "C": "Persistent thrush, or fungal skin infection: The infant has persistent thrush in the mouth, meeting this criterion.",
          "D": "Failure to thrive in an infant: The vignette does not mention any concerns about the infant's weight gain or growth, which is a specific warning sign.",
          "E": "Need for IV antibiotics to treat infections: The infant required two courses of intravenous antibiotics for pneumonia, meeting this criterion."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A 42-year-old male presents with a history of recurrent pneumonia (once yearly for the past 3 years), chronic diarrhea with unintentional weight loss, and recurrent herpes labialis. He denies any family history of known immunodeficiency. Which combination of these findings strongly suggests a potential Inborn Error of Immunity (IEI) in an adult patient?",
        "options": {
          "A": "Recurrent viral infections and chronic diarrhea only.",
          "B": "One pneumonia yearly and a family history of IEI.",
          "C": "Chronic diarrhea with weight loss and recurrent deep skin abscesses.",
          "D": "One pneumonia yearly for >1 year and recurrent viral infections.",
          "E": "Recurrent need for IV antibiotics and persistent fungal skin infection."
        },
        "answer": "D",
        "rationales": {
          "A": "While recurrent viral infections and chronic diarrhea are warning signs, the presence of yearly pneumonia for multiple years strengthens the suspicion for IEI.",
          "B": "The patient denies a family history of IEI, so this option is incorrect.",
          "C": "The patient does have chronic diarrhea with weight loss, but the vignette does not mention recurrent deep skin abscesses, though that is also an adult warning sign. This option is less comprehensive than D in reflecting the given vignette.",
          "D": "Correct. This choice best matches the mechanism/definition asked in the stem.",
          "E": "The vignette does not mention recurrent need for IV antibiotics or persistent fungal skin infection, though these are also adult warning signs for IEI."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A 4-year-old boy's mother reports 5 ear infections, 3 sinus infections, 2 pneumonias, and >3 months of antibiotics with little improvement in the past year. Which warning sign for Inborn Errors of Immunity (IEIs) is most clearly present?",
        "options": {
          "A": "≥2 episodes of sepsis or deep-seated infections",
          "B": "Failure to thrive in an infant",
          "C": "≥2 months on antibiotics with poor response",
          "D": "Persistent thrush or fungal skin infection",
          "E": "Abnormal newborn screen (TREC)"
        },
        "answer": "C",
        "rationales": {
          "C": "≥2 months of antibiotics with poor response is a classic IEI warning sign. He also meets criteria for ≥4 ear infections, ≥2 sinus infections, and ≥2 pneumonias per year.",
          "A": "No sepsis or organ abscesses described.",
          "B": "He is 4 years old, not an infant with FTT.",
          "D": "No fungal infections reported.",
          "E": "No newborn screen data provided."
        },
        "long_form": true
      }
    ],
    "First-Line Laboratory Tests for IEIs": [
      {
        "stem": "A 6-month-old with recurrent infections and low lymphocyte count is being evaluated for an IEI. Which test is considered a standard first-line laboratory screen?",
        "options": {
          "A": "Lymphocyte flow cytometry for T, B, NK cell subsets",
          "B": "Mitogen and antigen stimulation assays",
          "C": "Immunoglobulin levels (IgG, IgA, IgM, IgE)",
          "D": "Dihydrorhodamine (DHR) test for neutrophil oxidative burst",
          "E": "Whole exome sequencing"
        },
        "answer": "C",
        "rationales": {
          "C": "Measuring immunoglobulin levels is a standard, basic, first-line screen along with CBC. Can be ordered in primary care.",
          "A": "Second-line test usually ordered by immunologists.",
          "B": "Second-line test for lymphocyte proliferation.",
          "D": "Second-line test for CGD (neutrophil function).",
          "E": "Third-line advanced genetic testing."
        },
        "long_form": true
      }
    ],
    "Second-Line Laboratory Tests for IEIs": [
      {
        "stem": "A 2-year-old with recurrent bacterial infections, thrush, and family history of immunodeficiency is being evaluated. Initial CBC and immunoglobulins are inconclusive. Which second-line test best evaluates neutrophil oxidative burst for suspected CGD?",
        "options": {
          "A": "Isohemagglutinin titers",
          "B": "Lymphocyte flow cytometry for CD45RA/RO",
          "C": "Mitogen stimulation assay",
          "D": "Dihydrorhodamine (DHR) test",
          "E": "HIV-1 testing"
        },
        "answer": "D",
        "rationales": {
          "D": "The DHR test is the standard second-line assay for neutrophil oxidative burst, replacing the older NBT test, and is diagnostic for CGD.",
          "A": "Assesses IgM functional response, not neutrophils.",
          "B": "Assesses T-cell naive/memory subsets, not neutrophil function.",
          "C": "Tests lymphocyte proliferation, not neutrophils.",
          "E": "HIV testing evaluates acquired immunodeficiency, not primary CGD."
        },
        "long_form": true
      }
    ],
    "Role of Genotyping": [
      {
        "stem": "A 30-year-old woman is diagnosed with Common Variable Immunodeficiency (CVID) based on recurrent infections and persistently low IgG and IgA levels. Her immunologist recommends genetic testing. What is the most significant advantage of pursuing genotyping in this patient, beyond the phenotypic diagnosis of CVID?",
        "options": {
          "A": "To confirm the presence of an IgE-mediated allergy.",
          "B": "To determine the patient's HLA type for future organ transplantation.",
          "C": "To identify a specific molecular cause, guiding targeted therapies and genetic counseling.",
          "D": "To assess the functionality of her complement system.",
          "E": "To predict the likelihood of developing autoimmune diseases."
        },
        "answer": "C",
        "rationales": {
          "A": "Genotyping for CVID is not primarily for confirming IgE-mediated allergies, which are diagnosed via IgE levels and specific allergen testing.",
          "B": "While HLA typing is important for transplantation, it's not the primary reason for genotyping in a CVID patient to refine their specific immunodeficiency diagnosis.",
          "C": "Genotyping has become essential for definitive diagnosis of IEIs, moving beyond phenotypic descriptions like 'CVID'. It allows for precise genetic identification, which is critical for effective genetic counseling (e.g., X-linked vs. autosomal forms) and can guide targeted therapies (e.g., leniolisib for APDS, a specific PI3Kδ inhibitor in select CVID-labeled patients).",
          "D": "Complement system functionality is assessed by CH50, AH50, C3, and C4 levels, not by general IEI genotyping.",
          "E": "While CVID patients have an increased risk of autoimmunity, genotyping aims to diagnose the primary cause of immunodeficiency rather than simply predicting secondary complications."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A 25-year-old male with recurrent pyogenic infections and chronic diarrhea is initially given a phenotypic diagnosis of Common Variable Immunodeficiency (CVID) due to low IgG and IgA levels. Genetic testing reveals a gain-of-function variant in PI3KCD consistent with activated PI3Kδ syndrome (APDS). Which of the following is the most appropriate targeted therapy for this patient?",
        "options": {
          "A": "Gamma globulin replacement only.",
          "B": "High-dose oral corticosteroids.",
          "C": "A selective PI3Kδ inhibitor (e.g., leniolisib).",
          "D": "Bone marrow transplant.",
          "E": "Broad-spectrum antibiotics indefinitely."
        },
        "answer": "C",
        "rationales": {
          "A": "While gamma globulin replacement is a standard treatment for the antibody deficiency in CVID, the genetic diagnosis of APDS allows for a more targeted approach beyond just immunoglobulin replacement.",
          "B": "High-dose oral corticosteroids are broad immunosuppressants with many side effects and are not a specific targeted therapy for APDS.",
          "C": "A gain-of-function gene variant in PI3KCD results in APDS1 and APDS2 (activated phosphoinositide 3-kinase δ syndrome). A selective PI3Kδ inhibitor (leniolisib) has FDA approval for this condition. This exemplifies how specific genetic diagnoses can lead to targeted, rather than broad, therapies.",
          "D": "Bone marrow transplant might be considered for some severe IEIs, but for APDS, a targeted small molecule inhibitor is now available, making it a more specific option.",
          "E": "Broad-spectrum antibiotics manage infections but do not address the underlying immunodeficiency, and are not a targeted therapy for the genetic defect itself."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "IEI Phenotypes": [
      {
        "stem": "An infant presents with severe, recurrent infections including viral, bacterial, fungal, and protozoal pathogens. Laboratory tests reveal a very low age-related total lymphocyte count. This clinical presentation is most consistent with which Inborn Error of Immunity (IEI) phenotype?",
        "options": {
          "A": "Antibody deficiency phenotype",
          "B": "Phagocyte deficiency phenotype",
          "C": "T cell dysfunction phenotype",
          "D": "Combined immunodeficiency (SCID) phenotype",
          "E": "Hyper IgM phenotype"
        },
        "answer": "D",
        "rationales": {
          "A": "Antibody deficiency phenotype primarily causes recurrent bacterial infections, as antibodies are crucial opsonins, but patients can often manage infections requiring T cells.",
          "B": "Phagocyte deficiency phenotype presents with boils, deep-seated abscesses, pneumonia, and osteomyelitis, often caused by specific organisms like Aspergillus or Staphylococcus.",
          "C": "T cell dysfunction phenotype typically struggles with recurrent viral, fungal, and protozoal infections but can often handle pyogenic (bacterial) infections.",
          "D": "The combined immunodeficiency (SCID) phenotype is characterized by all types of infections (viral, bacterial, fungal, protozoal) and often presents with a low age-related total lymphocyte count. This description of being a \"walking agar plate\" is classic for SCID.",
          "E": "Hyper IgM phenotype features normal or elevated IgM levels with very low levels of other immunoglobulin classes (IgG, IgA, IgE), leading to mostly bacterial and some fungal infections."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A 7-year-old child frequently develops deep-seated skin abscesses, recurrent pneumonia, and osteomyelitis, often caused by Staphylococcus aureus and Aspergillus species. His white blood cell count is frequently elevated, and immunoglobulin levels are high. Which Inborn Error of Immunity (IEI) phenotype is most likely in this patient?",
        "options": {
          "A": "Combined immunodeficiency phenotype",
          "B": "Antibody deficiency phenotype",
          "C": "Complement deficiency phenotype",
          "D": "Phagocyte deficiency phenotype",
          "E": "T cell dysfunction phenotype"
        },
        "answer": "D",
        "rationales": {
          "A": "Combined immunodeficiency (SCID) phenotype would typically involve a broader spectrum of pathogens (viral, bacterial, fungal, protozoal) and often a low lymphocyte count.",
          "B": "Antibody deficiency phenotype primarily causes recurrent bacterial infections, but typically without a specific predilection for deep-seated abscesses or fungal infections like Aspergillus, and can usually handle infections requiring T cells.",
          "C": "Complement deficiency phenotype can lead to recurrent Neisseria infections (terminal complement deficiency) or other bacterial infections, but the specific pattern of deep abscesses and Aspergillus is less typical.",
          "D": "The phagocyte deficiency phenotype presents with boils, deep-seated abscesses, pneumonia, and osteomyelitis, often caused by specific organisms like Aspergillus or Staphylococcus. Hypergammaglobulinemia and leukocytosis can also be features. This clinical picture strongly points to a defect in phagocytic function, such as in Chronic Granulomatous Disease (CGD) or Leukocyte Adhesion Deficiency (LAD).",
          "E": "T cell dysfunction phenotype typically struggles with recurrent viral, fungal, and protozoal infections but can often handle pyogenic (bacterial) infections, which is the opposite of this patient's presentation."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A 45-year-old man presents with a long history of recurrent sinopulmonary infections, including bacterial pneumonia and chronic sinusitis. Laboratory workup reveals persistently low levels of IgG and IgA, with normal IgM levels, and poor antibody responses to vaccinations. There is no clear alternative explanation for these findings. This constellation of findings is considered a preliminary, phenotypic diagnosis of which of the following?",
        "options": {
          "A": "Selective IgA deficiency",
          "B": "X-linked agammaglobulinemia (XLA)",
          "C": "Common Variable Immunodeficiency (CVID)",
          "D": "Hyper IgM syndrome",
          "E": "Transient hypogammaglobulinemia of infancy"
        },
        "answer": "C",
        "rationales": {
          "A": "Selective IgA deficiency involves only low IgA, with normal IgG and IgM, and patients can be asymptomatic or have milder infections. This patient has low IgG as well.",
          "B": "X-linked agammaglobulinemia (XLA) involves very low (near zero) levels of all immunoglobulin classes (IgG, IgA, IgM) due to a block in B cell development. This patient has normal IgM.",
          "C": "Common Variable Immunodeficiency (CVID) is a very heterogeneous group of disorders presenting with an antibody deficiency phenotype, specifically when two or more immunoglobulin classes (typically IgG and IgA) are low, without an alternative explanation. The patient's recurrent bacterial infections and low IgG and IgA levels fit this preliminary, phenotypic diagnosis.",
          "D": "Hyper IgM syndrome is characterized by normal or elevated IgM levels with very low levels of other immunoglobulin classes (IgG, IgA, IgE) due to impaired class switching. This patient has low IgG and IgA but normal IgM.",
          "E": "Transient hypogammaglobulinemia of infancy is a temporary condition in infants with delayed normal immunoglobulin production, which resolves with age, and would not be diagnosed in a 45-year-old man."
        },
        "difficulty": "Easy",
        "long_form": true
      }
    ],
    "SCID Immunophenotypes": [
      {
        "stem": "A 1-year-old infant presents with recurrent severe infections, lymphopenia, and low levels of all immunoglobulin classes. Flow cytometry is ordered and reveals an absence of T cells, B cells, and NK cells (T- B- NK- SCID). Which specific genetic defect is this immunophenotype most consistent with?",
        "options": {
          "A": "IL2RG (common gamma chain) deficiency",
          "B": "RAG1 or RAG2 deficiency",
          "C": "ADA (adenosine deaminase) deficiency",
          "D": "IL7RA deficiency",
          "E": "CD40L deficiency"
        },
        "answer": "C",
        "rationales": {
          "A": "IL2RG (common gamma chain, γc) deficiency and JAK3 deficiency are associated with a T- B+ NK- SCID immunophenotype.",
          "B": "RAG1 or RAG2 deficiency and Artemis deficiency are associated with a T- B- NK+ SCID immunophenotype.",
          "C": "T- B- NK- SCID (absence of T cells, B cells, and NK cells) is characteristic of a metabolic defect, such as ADA (adenosine deaminase) deficiency. ADA deficiency leads to the accumulation of toxic metabolites that impair the development and function of all lymphocyte lineages.",
          "D": "IL7RA deficiency and CD3 chain deficiencies are associated with a T- B+ NK+ SCID immunophenotype.",
          "E": "CD40L deficiency presents as a Hyper IgM phenotype, not an absence of T, B, and NK cells, as patients typically have normal numbers of B cells but impaired class switching."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A newborn is diagnosed with Severe Combined Immunodeficiency (SCID). Flow cytometry analysis reveals a T- B+ NK- immunophenotype. Which of the following genetic defects is most commonly associated with this specific SCID immunophenotype?",
        "options": {
          "A": "RAG1 or RAG2 deficiency",
          "B": "ADA deficiency",
          "C": "p56Lck deficiency",
          "D": "IL2RG (common gamma chain, γc) deficiency",
          "E": "IL7RA deficiency"
        },
        "answer": "D",
        "rationales": {
          "A": "RAG1 or RAG2 deficiency results in T- B- NK+ SCID because both T and B cell development are blocked at an early stage, while NK cells are unaffected.",
          "B": "ADA (adenosine deaminase) deficiency results in T- B- NK- SCID, as toxic metabolites impair the development of all lymphocyte lineages.",
          "C": "p56Lck deficiency is associated with T+ B+ NK+ SCID, as it affects T cell signaling but not their initial presence.",
          "D": "IL2RG (common gamma chain, γc) deficiency and JAK3 deficiency are typically associated with a T- B+ NK- SCID immunophenotype. The common gamma chain is a component of multiple cytokine receptors (e.g., IL-2, IL-7, IL-15) critical for T cell and NK cell development, but B cell development is less affected.",
          "E": "IL7RA deficiency (IL-7 receptor alpha chain) is associated with T- B+ NK+ SCID because IL-7 signaling is crucial for T cell development, but NK cells are not completely absent."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "An infant presenting with life-threatening infections is diagnosed with SCID. Genetic sequencing reveals a mutation in either RAG1 or RAG2. Based on this genetic defect, what is the most expected lymphocyte immunophenotype on flow cytometry?",
        "options": {
          "A": "T+ B+ NK+ SCID",
          "B": "T- B+ NK- SCID",
          "C": "T- B+ NK+ SCID",
          "D": "T- B- NK- SCID",
          "E": "T- B- NK+ SCID"
        },
        "answer": "E",
        "rationales": {
          "A": "T+ B+ NK+ SCID is seen in conditions like p56Lck deficiency.",
          "B": "T- B+ NK- SCID is characteristic of IL2RG or JAK3 deficiency.",
          "C": "T- B+ NK+ SCID is associated with IL7RA or CD3 chain deficiencies.",
          "D": "T- B- NK- SCID is typically caused by metabolic defects such as ADA deficiency.",
          "E": "RAG1 or RAG2 deficiency (Recombination-Activating Genes) leads to a T- B- NK+ SCID immunophenotype. RAG proteins are essential for V(D)J recombination, which is the process that generates diversity in T-cell receptors and B-cell immunoglobulins. A defect in RAG1 or RAG2 prevents the development of both T and B lymphocytes. However, NK cell development is independent of V(D)J recombination, so NK cells are present."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "CVID": [
      {
        "stem": "A 40-year-old man with CVID continues to have infections despite Ig replacement. His physician explains CVID is heterogeneous, but certain genetic defects are 'high-yield.' Which are they?",
        "options": {
          "A": "RAG1 and RAG2",
          "B": "CD40L and NEMO",
          "C": "BAFF, TACI, and APRIL",
          "D": "IL2RG and JAK3",
          "E": "p53 and RB"
        },
        "answer": "C",
        "rationales": {
          "C": "BAFF, TACI, APRIL are key B-cell survival/differentiation pathways and strongly linked to CVID phenotype.",
          "A": "RAG → SCID, not CVID.",
          "B": "CD40L/NEMO → Hyper IgM, not CVID.",
          "D": "IL2RG/JAK3 → SCID.",
          "E": "p53/RB → tumor suppressors, not immunodeficiency."
        },
        "long_form": true
      }
    ]
  },
  "Inflammation and Repair (Samra)": {
    "Purposes and Cardinal Signs of Inflammation": [
      {
        "stem": "A patient sustains a minor cut on their finger, which quickly becomes red, swollen, warm, and painful. Which of the following is considered a primary purpose of this inflammatory response?",
        "options": {
          "A": "To induce apoptosis of healthy cells",
          "B": "To spread infectious agents throughout the body",
          "C": "To remove necrotic cells and initiate tissue repair",
          "D": "To immediately form a permanent fibrous scar",
          "E": "To suppress the innate immune system"
        },
        "answer": "C",
        "rationales": {
          "C": "Inflammation’s purposes include eliminating the inciting cause, removing necrotic tissue, and initiating repair. The cardinal signs (redness, heat, swelling, pain) reflect this process.",
          "A": "Apoptosis is programmed cell death, not the goal of inflammation.",
          "B": "Inflammation contains and eliminates pathogens, not spread them.",
          "D": "Fibrous scar occurs later; initial inflammation promotes repair but not immediate scar formation.",
          "E": "Inflammation is part of the innate immune system, not its suppression."
        },
        "long_form": true
      }
    ],
    "Acute Inflammation": [
      {
        "stem": "A 25-year-old man steps on a rusty nail, leading to a localized bacterial infection. Within hours, the area becomes red and swollen. Histology would primarily reveal which cell type?",
        "options": {
          "A": "Lymphocytes",
          "B": "Plasma cells",
          "C": "Macrophages",
          "D": "Neutrophils",
          "E": "Fibroblasts"
        },
        "answer": "D",
        "rationales": {
          "D": "Neutrophils dominate acute inflammation (minutes–days). They exit circulation quickly and accumulate at the site of infection.",
          "A": "Lymphocytes are more characteristic of chronic inflammation.",
          "B": "Plasma cells also appear in chronic inflammation.",
          "C": "Macrophages arrive later (2–3 days) and play a role in resolution/chronic inflammation.",
          "E": "Fibroblasts participate in repair, not the acute infiltrate."
        },
        "long_form": true
      }
    ],
    "Chronic Inflammation": [
      {
        "stem": "A 40-year-old woman with chronic cough and weight loss undergoes lung biopsy. Histology shows collections of activated macrophages (epithelioid histiocytes) with lymphocytes and central necrosis. Which type of inflammation is this?",
        "options": {
          "A": "Acute suppurative inflammation",
          "B": "Fibrinoid necrosis",
          "C": "Chronic granulomatous inflammation",
          "D": "Serous inflammation",
          "E": "Acute interstitial inflammation"
        },
        "answer": "C",
        "rationales": {
          "C": "Granulomatous inflammation = epithelioid macrophages + giant cells, often with caseous necrosis (e.g., TB). It is a subtype of chronic inflammation.",
          "A": "Suppurative inflammation = neutrophils/pus, not granulomas.",
          "B": "Fibrinoid necrosis = vascular pathology, not inflammation type.",
          "D": "Serous inflammation = fluid exudate, not granulomas.",
          "E": "Interstitial inflammation = acute neutrophilic infiltrate, not organized granulomas."
        },
        "long_form": true
      }
    ],
    "Systemic Effects of Inflammation": [
      {
        "stem": "A 7-year-old boy with bacterial infection has fever, leukocytosis, and elevated ESR. The increased ESR is due to which acute-phase protein?",
        "options": {
          "A": "Albumin",
          "B": "C-reactive protein (CRP)",
          "C": "Fibrinogen",
          "D": "Hepcidin",
          "E": "Transferrin"
        },
        "answer": "C",
        "rationales": {
          "C": "Fibrinogen promotes rouleaux formation → faster RBC sedimentation → elevated ESR.",
          "A": "Albumin decreases in inflammation (negative acute phase reactant).",
          "B": "CRP is an acute-phase protein but does not cause ESR rise.",
          "D": "Hepcidin regulates iron metabolism, not ESR.",
          "E": "Transferrin is iron transport protein, not main ESR contributor."
        },
        "long_form": true
      }
    ],
    "Tissue Repair": [
      {
        "stem": "A 60-year-old man suffers a large myocardial infarction. Despite therapy, his heart muscle cannot regain its function. This occurs because cardiac tissue is classified as which type of regenerative tissue?",
        "options": {
          "A": "Labile tissue",
          "B": "Stabile tissue",
          "C": "Permanent tissue",
          "D": "Connective tissue",
          "E": "Epithelial tissue"
        },
        "answer": "C",
        "rationales": {
          "C": "Myocardium and neurons are permanent tissues → no regenerative capacity, healing only by scar.",
          "A": "Labile tissues (skin, marrow, mucosa) regenerate readily.",
          "B": "Stabile tissues (liver, kidney) regenerate when stimulated.",
          "D": "Scar is connective tissue, but the classification is about the original tissue.",
          "E": "Epithelial tissue often regenerates, not scar-only repair."
        },
        "long_form": true
      },
      {
        "stem": "A 30-year-old African American woman develops a thick, raised scar on her chest after a burn. The scar extends beyond the wound boundaries and keeps growing. What is this abnormality called?",
        "options": {
          "A": "Wound dehiscence",
          "B": "Ulceration",
          "C": "Keloid",
          "D": "Contracture",
          "E": "Hypertrophic scar"
        },
        "answer": "C",
        "rationales": {
          "C": "Keloid = excessive collagen scar extending beyond wound borders, common in African Americans.",
          "A": "Dehiscence = wound rupture, not overgrowth.",
          "B": "Ulcer = loss of epithelium/necrosis, not scar overgrowth.",
          "D": "Contracture = excessive wound contraction → deformity, not expansion beyond boundaries.",
          "E": "Hypertrophic scar = raised scar confined to wound area, unlike keloid."
        },
        "long_form": true
      }
    ],
    "Abnormalities in Tissue Repair": [
      {
        "stem": "A 40-year-old postoperative patient develops sudden wound opening after a bout of coughing. Which abnormality of tissue repair best explains this complication?",
        "options": {
          "A": "Keloid",
          "B": "Contracture",
          "C": "Ulceration",
          "D": "Wound dehiscence",
          "E": "Primary intention healing"
        },
        "answer": "D",
        "rationales": {
          "A": "Keloid = excessive collagen deposition extending beyond wound borders.",
          "B": "Contracture = excessive wound contraction, not rupture.",
          "C": "Ulceration = local necrosis with tissue sloughing.",
          "D": "Dehiscence = rupture of a wound, often after stress like coughing.",
          "E": "Primary intention healing = normal approximation of wound edges."
        },
        "long_form": true
      },
      {
        "stem": "A 28-year-old woman presents with a raised scar extending beyond her ear-piercing site. Histology shows thick bundles of collagen. What is the most likely diagnosis?",
        "options": {
          "A": "Hypertrophic scar",
          "B": "Keloid",
          "C": "Contracture",
          "D": "Ulceration",
          "E": "Dehiscence"
        },
        "answer": "B",
        "rationales": {
          "A": "Hypertrophic scars stay confined to wound boundaries.",
          "B": "Keloids extend beyond wound edges due to excessive collagen.",
          "C": "Contracture = tightening and deformity, not raised scar.",
          "D": "Ulceration = necrosis, not scar overgrowth.",
          "E": "Dehiscence = wound rupture, not excessive scar."
        },
        "long_form": true
      }
    ]
  },
  "HIV Pathogenesis & Common Opportunistic Infections in AIDS Patients (Anderson)": {
    "HIV Pathophysiology and CD4 Coreceptors": [
      {
        "stem": "A patient is being evaluated for HIV infection. The virus primarily targets specific immune cells that express a transmembrane glycoprotein crucial for immune function. Which cell type, characterized by this glycoprotein, serves as the main binding site for HIV?",
        "options": {
          "A": "B lymphocytes",
          "B": "Natural Killer (NK) cells",
          "C": "CD4 T cells",
          "D": "Macrophages",
          "E": "Dendritic cells"
        },
        "answer": "C",
        "rationales": {
          "A": "B lymphocytes primarily express CD19 and CD20, and while they play a role in the immune response, they are not the primary target for HIV binding via CD4.",
          "B": "Natural Killer (NK) cells are part of the innate immune system and do not express CD4, so they are not directly targeted by HIV via this mechanism.",
          "C": "HIV primarily targets CD4 T cells, which express the CD4 transmembrane glycoprotein. This glycoprotein serves as a binding site for HIV. While macrophages and dendritic cells also express CD4 and can be infected, CD4 T cells are the main target, leading to their depletion and subsequent immunosuppression.",
          "D": "Macrophages do express CD4 and chemokine receptors and can be infected by HIV, especially CCR5-tropic strains. However, CD4 T cells are the predominant and most critical target, leading to immunodeficiency.",
          "E": "Dendritic cells, like macrophages, express CD4 and can be infected, playing a role in viral dissemination, but CD4 T cells are the main targets for depletion."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient is identified as homozygous for the CCR5 Δ32 gene mutation. This genetic characteristic would most likely result in which of the following outcomes regarding HIV infection?",
        "options": {
          "A": "Rapid progression to AIDS upon HIV exposure.",
          "B": "Resistance to HIV infection.",
          "C": "Slower disease progression but not full resistance.",
          "D": "Increased susceptibility to CXCR4-tropic HIV strains.",
          "E": "Enhanced CD4 T cell counts despite HIV infection."
        },
        "answer": "B",
        "rationales": {
          "A": "This is incorrect. Homozygous CCR5 Δ32 mutation provides resistance, not rapid progression.",
          "B": "A CCR5 Δ32 gene mutation, when homozygous, results in the absence of the CCR5 coreceptor from the cell surface. Since HIV primarily uses CCR5 (or CXCR4) as a co-receptor to aid in binding and cell entry, homozygous individuals are resistant to HIV infection.",
          "C": "Slower disease progression but not full resistance is seen in individuals who are heterozygous for the CCR5 Δ32 mutation.",
          "D": "The CCR5 Δ32 mutation only affects the CCR5 coreceptor. It does not inherently increase susceptibility to CXCR4-tropic strains; rather, if an individual were to be infected by a CXCR4-tropic strain, the CCR5 mutation would not provide protection.",
          "E": "The mutation affects the co-receptor for HIV entry and does not directly enhance CD4 T cell counts during an infection; instead, it prevents infection entirely in homozygous individuals. HIV Progression and AIDS Definition"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A 35-year-old male is newly diagnosed with HIV. His CD4 T cell count is 150 cells/mm³. Based on the CDC classification, this patient's CD4 count indicates that he has progressed to which stage of HIV disease?",
        "options": {
          "A": "Acute phase",
          "B": "Chronic phase",
          "C": "AIDS",
          "D": "Latent phase",
          "E": "Seroconversion"
        },
        "answer": "C",
        "rationales": {
          "A": "The acute phase of HIV infection is characterized by initial rapid viral replication and a rapid drop in CD4 cells, but usually, the CD4 count is still generally above 200 cells/mm³ during this initial symptomatic period.",
          "B": "The chronic phase (clinical latency) is often asymptomatic, with CD4 counts plateauing, typically between 200-500 cells/mm³, before further decline.",
          "C": "AIDS (Acquired Immunodeficiency Syndrome) is defined by a CD4 count below 200 cells/mm³ or the presence of an opportunistic infection or other AIDS-defining condition. With a CD4 count of 150 cells/mm³, the patient meets the criteria for an AIDS diagnosis.",
          "D": "Latent phase is synonymous with the chronic phase or clinical latency, not a separate stage after the CD4 count drops below 200.",
          "E": "Seroconversion is the point at which antibodies to HIV become detectable in the blood, typically occurring during the acute phase of infection, and is not a stage based on CD4 count criteria."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient with long-standing HIV infection presents with Pneumocystis jirovecii Pneumonia (PCP). Her most recent CD4 count was 250 cells/mm³. According to the definition of AIDS, why is this patient still considered to have AIDS, despite her CD4 count being above 200 cells/mm³?",
        "options": {
          "A": "PCP is an opportunistic infection that can occur at any CD4 count.",
          "B": "The definition of AIDS is based solely on viral load, not CD4 count.",
          "C": "The presence of an AIDS-defining opportunistic infection, regardless of CD4 count, defines AIDS.",
          "D": "Her CD4 count was likely below 200 cells/mm³ at some point in the past.",
          "E": "This is an error in classification; she should not be considered to have AIDS."
        },
        "answer": "C",
        "rationales": {
          "A": "While PCP is an opportunistic infection, the statement that it can occur at any CD4 count is generally not true for its AIDS-defining role; it typically occurs when CD4 < 200. However, the key point is that its presence is an AIDS-defining event.",
          "B": "The definition of AIDS incorporates both CD4 count and AIDS-defining conditions; it is not based solely on viral load.",
          "C": "AIDS (Acquired Immunodeficiency Syndrome) is defined by a CD4 count below 200 cells/mm³ OR the presence of an opportunistic infection (OI) or other AIDS-defining condition. Pneumocystis jirovecii Pneumonia (PCP) is explicitly listed as an AIDS-defining condition. Therefore, regardless of her current CD4 count, the diagnosis of PCP means she has AIDS.",
          "D": "While her CD4 count might have been below 200 in the past, her current diagnosis of an AIDS-defining illness is sufficient to classify her as having AIDS, independent of prior counts or current count above 200.",
          "E": "This is incorrect. Her classification is accurate based on the presence of an AIDS-defining opportunistic infection. Opportunistic Infections"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A 30-year-old male with newly diagnosed HIV, whose CD4 count is 75 cells/mm³, presents with headache, fever, and neck stiffness. Cerebrospinal fluid (CSF) analysis reveals positive cryptococcal antigen (CrAg). This opportunistic infection is caused by which type of pathogen?",
        "options": {
          "A": "Bacterium",
          "B": "Virus",
          "C": "Fungus",
          "D": "Protozoan",
          "E": "Helminth"
        },
        "answer": "C",
        "rationales": {
          "A": "Bacteria cause various infections, but cryptococcal meningitis is a fungal infection.",
          "B": "Viruses cause conditions like PML (JC virus) or CMV retinitis, but not cryptococcal meningitis.",
          "C": "Cryptococcosis, caused by Cryptococcus neoformans/gattii, is a fungal infection that commonly presents as meningitis in immunocompromised patients, particularly those with CD4 counts < 50 cells/mm³ (though it can occur at higher counts). Diagnosis is confirmed by cryptococcal antigen (CrAg) and PCR/culture from CSF.",
          "D": "Protozoa cause infections like Toxoplasmosis, but not cryptococcal meningitis.",
          "E": "Helminths (worms) are not typically associated with cryptococcal meningitis."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A medical student is learning about the initial steps of HIV infection. HIV primarily targets specific immune cells and uses co-receptors to facilitate entry. Which cells and co-receptors are the primary targets?",
        "options": {
          "A": "B cells and CXCR4",
          "B": "CD8 T cells and CCR5",
          "C": "Macrophages and CD4 and CCR5",
          "D": "Natural Killer cells and CXCR4",
          "E": "Neutrophils and CD4"
        },
        "answer": "C",
        "rationales": {
          "C": "HIV binds CD4 + chemokine co-receptors (CCR5, CXCR4) on CD4+ T cells and macrophages. CCR5 is used early, CXCR4 later.",
          "A": "B cells are not the main HIV targets.",
          "B": "CD8 T cells lack CD4 receptors and are not directly infected.",
          "D": "NK cells do not use CXCR4 as an HIV entry receptor.",
          "E": "Neutrophils do not express CD4."
        },
        "long_form": true
      }
    ],
    "HIV Progression and AIDS Definition": [
      {
        "stem": "A 40-year-old man with untreated HIV for 10 years presents with fever, weight loss, and severe dysphagia. Endoscopy shows Candida esophagitis. CD4 count is 150 cells/mm³. What is the correct classification of his HIV stage?",
        "options": {
          "A": "Acute HIV infection",
          "B": "Chronic asymptomatic HIV infection",
          "C": "AIDS (Acquired Immunodeficiency Syndrome)",
          "D": "HIV seroconversion syndrome",
          "E": "Elite controller stage"
        },
        "answer": "C",
        "rationales": {
          "C": "AIDS = CD4 <200 or any AIDS-defining opportunistic infection (e.g., Candida esophagitis). This patient has both.",
          "A": "Acute HIV occurs weeks after infection with flu-like illness.",
          "B": "Chronic asymptomatic HIV has CD4 >200 and no OIs.",
          "D": "Seroconversion = acute primary infection.",
          "E": "Elite controllers maintain undetectable viral loads without ART, not described here."
        },
        "long_form": true
      }
    ],
    "Opportunistic Infections (OIs)": [
      {
        "stem": "A 38-year-old man with AIDS (CD4 = 10) presents with seizure, headache, and weakness. CT shows two ring-enhancing masses with edema near the basal ganglia. Which pathogen is most likely?",
        "options": {
          "A": "Epstein-Barr virus (EBV)",
          "B": "JC virus",
          "C": "Toxoplasma gondii",
          "D": "Cryptococcus neoformans",
          "E": "Human herpesvirus-8 (HHV-8)"
        },
        "answer": "C",
        "rationales": {
          "C": "Toxoplasma gondii reactivation is the most common cause of multiple ring-enhancing brain lesions in AIDS patients with CD4 <100.",
          "A": "EBV causes CNS lymphoma; usually solitary lesions, not multiple ring-enhancing ones.",
          "B": "JC virus → PML, demyelination, non-enhancing lesions.",
          "D": "Cryptococcus → meningitis, not ring-enhancing brain masses.",
          "E": "HHV-8 → Kaposi sarcoma, not brain lesions."
        },
        "long_form": true
      },
      {
        "stem": "A 29-year-old HIV-positive man (CD4 = 75) is IgG positive for Toxoplasma gondii. Which prophylaxis should be started, and at what CD4 threshold is it indicated?",
        "options": {
          "A": "Azithromycin, CD4 <50",
          "B": "Trimethoprim/sulfamethoxazole (TMP/SMX), CD4 <200",
          "C": "Trimethoprim/sulfamethoxazole (TMP/SMX), CD4 <100",
          "D": "Liposomal amphotericin B, CD4 <50",
          "E": "Fluconazole, CD4 <100"
        },
        "answer": "C",
        "rationales": {
          "C": "Toxoplasma prophylaxis = TMP/SMX if CD4 <100 and patient is IgG positive.",
          "A": "Azithromycin is for MAC prophylaxis at CD4 <50.",
          "B": "TMP/SMX prophylaxis for PCP starts at CD4 <200, but toxoplasma requires IgG positivity + CD4 <100.",
          "D": "Amphotericin B treats cryptococcal meningitis, not used for prophylaxis.",
          "E": "Fluconazole is not used for toxoplasma prophylaxis."
        },
        "long_form": true
      },
      {
        "stem": "An HIV-positive patient with a CD4 count of 80 cells/mcL and positive Toxoplasma IgG serology is currently on Trimethoprim/Sulfamethoxazole (TMP/SMX) for prophylaxis. The patient starts antiretroviral therapy (ART), and after 6 months, their CD4 count consistently rises to 250 cells/mcL with an undetectable viral load. Which of the following is the most appropriate next step regarding their Toxoplasma prophylaxis?",
        "options": {
          "A": "Continue TMP/SMX indefinitely as Toxoplasma IgG remains positive.",
          "B": "Discontinue TMP/SMX, as the CD4 count is above the threshold with viral suppression.",
          "C": "Switch to a different prophylaxis agent due to potential resistance.",
          "D": "Increase the dose of TMP/SMX to prevent breakthrough infection.",
          "E": "Initiate MAC prophylaxis due to the history of low CD4 count."
        },
        "answer": "B",
        "rationales": {
          "A": "Continuing TMP/SMX indefinitely is unnecessary once immune reconstitution has occurred, as it exposes the patient to potential drug toxicities and costs.",
          "B": "Prophylaxis for Toxoplasma can generally be discontinued when the CD4 count is consistently > 200 cells/mm³ (or 100-200 with HIV RNA suppression) for at least 3-6 months. Since the patient's CD4 count is 250 cells/mcL and the viral load is undetectable after 6 months of ART, it is appropriate to discontinue Toxoplasma prophylaxis.",
          "C": "Switching to a different prophylaxis agent is not indicated if prophylaxis can be safely discontinued.",
          "D": "Increasing the dose of TMP/SMX is not appropriate; the goal is to safely discontinue prophylaxis.",
          "E": "MAC prophylaxis is indicated when CD4 < 50 cells/mcL and the patient is not on fully suppressive ART. This patient's CD4 count is 250 cells/mcL and viral load is undetectable, making MAC prophylaxis unnecessary."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Prophylaxis and Treatment Thresholds for OIs": [
      {
        "stem": "A 32-year-old HIV-positive patient is initiating antiretroviral therapy (ART). Her current CD4 T cell count is 180 cells/mcL. Which opportunistic infection should be considered for primary prophylaxis based on this CD4 count?",
        "options": {
          "A": "Toxoplasmosis",
          "B": "Mycobacterium Avium Complex (MAC)",
          "C": "Cytomegalovirus (CMV) retinitis",
          "D": "Pneumocystis jirovecii Pneumonia (PCP)",
          "E": "Kaposi Sarcoma"
        },
        "answer": "D",
        "rationales": {
          "A": "Prophylaxis for Toxoplasmosis is generally given when CD4 < 100 cells/mcL AND the patient is IgG positive for Toxoplasma.",
          "B": "Prophylaxis for Mycobacterium Avium Complex (MAC) is typically initiated when CD4 < 50 cells/mcL and the patient is not on fully suppressive antiretrovirals.",
          "C": "Prophylaxis for Cytomegalovirus (CMV) retinitis is not routinely recommended for all patients at a CD4 count of 180; treatment is initiated upon diagnosis of disease, especially for end-organ disease.",
          "D": "Prophylaxis for Pneumocystis jirovecii Pneumonia (PCP) is indicated when the CD4 count is < 200 cells/mcL or < 14%. With a CD4 count of 180 cells/mcL, this patient meets the threshold for PCP prophylaxis.",
          "E": "Kaposi Sarcoma is caused by HHV-8, and its treatment primarily involves antiretrovirals and chemotherapy; specific primary prophylaxis with a drug is not standard based on CD4 count."
        },
        "difficulty": "Easy",
        "long_form": true
      }
    ]
  },
  "Herpes Virus Infections (Newman / ECHO_Herpes Virus Infections_2024)": {
    "Overview of Human Herpesviruses": [
      {
        "stem": "A medical student is reviewing the characteristics of human herpesviruses. Which of the following is a fundamental structural feature shared by all human herpesviruses?",
        "options": {
          "A": "Single-stranded RNA genome",
          "B": "Naked (non-enveloped) capsid",
          "C": "Large double-stranded DNA genome",
          "D": "Ability to replicate only in the cytoplasm",
          "E": "Segmented genome for genetic reassortment"
        },
        "answer": "C",
        "rationales": {
          "A": "Herpesviruses have a DNA genome, not a single-stranded RNA genome. RNA viruses have RNA genomes.",
          "B": "Herpesviruses are enveloped viruses, meaning they acquire a portion of the host cell membrane. Naked viruses lack an envelope.",
          "C": "All human herpesviruses are large double-stranded DNA (dsDNA) viruses. They also possess an outer envelope, tegument, nucleocapsid, and inner DNA core.",
          "D": "While some viruses replicate in the cytoplasm, DNA viruses (including herpesviruses) primarily replicate in the nucleus of the host cell, with some exceptions like poxviruses and HBV.",
          "E": "Herpesviruses do not have segmented genomes; segmented genomes are characteristic of viruses like influenza virus and rotavirus, which allows for genetic reassortment."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A key characteristic of human herpesviruses is their ability to establish latency within host cells, where no infectious virions are produced. Which of the following statements accurately describes the primary site of latency for Herpes Simplex Virus (HSV) 1 and 2, and a general consequence of viral latency?",
        "options": {
          "A": "Latency in lymphoid cells; leads to immediate host cell lysis.",
          "B": "Latency in neuronal cells; allows for subsequent reactivation.",
          "C": "Latency in epithelial cells; prevents the host immune response.",
          "D": "Latency in fibroblasts; results in continuous, low-level viral shedding.",
          "E": "Latency in bone marrow cells; causes chronic inflammation without reactivation."
        },
        "answer": "B",
        "rationales": {
          "A": "While other herpesviruses (e.g., EBV) may establish latency in lymphoid cells, HSV 1/2 primarily latches in neuronal cells. Latency does not lead to immediate cell lysis, but rather quiescent infection.",
          "B": "A key characteristic of herpesviruses is latency, where no infectious virions are produced. For HSV 1/2, the primary latent site is neuronal cells (specifically sensory ganglia). Latency allows the virus to persist in the host and permits subsequent reactivation due to various host/viral factors.",
          "C": "Epithelial cells are primary sites of replication and productive infection during active disease, not the primary site of latency for HSV. Latency does not necessarily prevent the host immune response; rather, it allows evasion.",
          "D": "Fibroblasts are not the primary latent site for HSV. Continuous, low-level viral shedding is characteristic of some persistent infections, but not necessarily latency where virions are not produced.",
          "E": "Bone marrow cells are not the primary latent site for HSV. Latency can lead to reactivation and subsequent acute disease, not simply chronic inflammation without reactivation. HSV Clinical Features and Diagnosis"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "Which characteristic is true for all human herpesviruses, including HSV and CMV?",
        "options": {
          "A": "They are non-enveloped RNA viruses",
          "B": "They replicate exclusively in the cytoplasm",
          "C": "They are capable of establishing latent infections",
          "D": "They are primarily transmitted fecal-orally",
          "E": "They lack a protein coat (capsid)"
        },
        "answer": "C",
        "rationales": {
          "C": "Latency with reactivation is the defining feature of herpesviruses.",
          "A": "They are enveloped DNA viruses.",
          "B": "They replicate in the nucleus, not only cytoplasm.",
          "D": "They spread via body fluids, not fecal-oral route.",
          "E": "All viruses have capsids."
        },
        "long_form": true
      }
    ],
    "HSV Clinical Features and Diagnosis": [
      {
        "stem": "A 65-year-old man with fever, confusion, and behavioral changes has temporal lobe inflammation and RBCs in CSF. What is the definitive diagnostic test?",
        "options": {
          "A": "Serum cryptococcal antigen",
          "B": "Viral culture of CSF",
          "C": "CSF HSV-1 PCR",
          "D": "Herpesvirus IgM in serum",
          "E": "CMV PCR of blood"
        },
        "answer": "C",
        "rationales": {
          "C": "HSV encephalitis diagnosis is confirmed by HSV PCR of CSF.",
          "A": "CrAg testing diagnoses cryptococcus, not HSV.",
          "B": "Culture is slow/insensitive compared to PCR.",
          "D": "IgM is not diagnostic of CNS involvement.",
          "E": "CMV PCR of blood does not diagnose HSV encephalitis."
        },
        "long_form": true
      }
    ],
    "VZV Clinical Features and Complications": [
      {
        "stem": "An 82-year-old man with dermatomal vesicular rash is diagnosed with shingles. What is the most common late complication?",
        "options": {
          "A": "Acute retinal necrosis",
          "B": "Herpes encephalitis",
          "C": "Post-herpetic neuralgia",
          "D": "Disseminated zoster",
          "E": "Neonatal herpes"
        },
        "answer": "C",
        "rationales": {
          "C": "Post-herpetic neuralgia is the most common late complication, especially in elderly.",
          "A": "Retinal necrosis is less common.",
          "B": "HSV, not VZV, causes encephalitis classically.",
          "D": "Disseminated zoster occurs in immunocompromised but is not the most common.",
          "E": "Neonatal herpes occurs in infants, not elderly."
        },
        "long_form": true
      }
    ],
    "EBV and CMV Infections": [
      {
        "stem": "A 19-year-old college student with fever, sore throat, lymphadenopathy, and splenomegaly has positive heterophile antibody (Monospot). What is the diagnosis?",
        "options": {
          "A": "CMV mononucleosis; positive CMV PCR",
          "B": "Infectious mononucleosis (EBV); negative heterophile antibody",
          "C": "CMV mononucleosis; negative heterophile antibody",
          "D": "Infectious mononucleosis (EBV); positive heterophile antibody",
          "E": "Primary HIV infection; positive HIV ELISA"
        },
        "answer": "D",
        "rationales": {
          "D": "EBV mononucleosis shows atypical lymphocytosis + positive heterophile antibody test.",
          "A": "CMV mono is heterophile negative.",
          "B": "EBV mono is heterophile positive.",
          "C": "CMV mono is heterophile negative, but this patient is positive.",
          "E": "Acute HIV may mimic mono but Monospot would be negative."
        },
        "long_form": true
      }
    ],
    "HHV-6/7 and HHV-8": [
      {
        "stem": "A 9-month-old infant develops high fever for 3 days, then a trunk rash after defervescence. What is the causative virus?",
        "options": {
          "A": "HSV-1",
          "B": "VZV",
          "C": "CMV",
          "D": "HHV-6",
          "E": "HHV-8"
        },
        "answer": "D",
        "rationales": {
          "D": "HHV-6B causes roseola (exanthem subitum) with high fever then rash.",
          "A": "HSV-1 causes oral lesions, encephalitis.",
          "B": "VZV causes chickenpox/shingles.",
          "C": "CMV causes congenital disease or mono-like illness.",
          "E": "HHV-8 causes Kaposi sarcoma, not roseola."
        },
        "long_form": true
      }
    ]
  },
  "Viral Structure & Pathogenesis (Thai)": {
    "Basic Viral Structure": [
      {
        "stem": "A researcher is studying a newly identified virus. Electron microscopy reveals that the virus is composed of a protein coat surrounding its genetic material and an outer lipid bilayer derived from the host cell membrane. Based on this description, which of the following characteristics is most likely true for this virus?",
        "options": {
          "A": "It is a naked virus.",
          "B": "It is stable and resistant to detergents.",
          "C": "It is typically transmitted by the fecal/oral route.",
          "D": "It is sensitive to acid and drying.",
          "E": "Its genetic material is always RNA."
        },
        "answer": "D",
        "rationales": {
          "A": "Naked viruses lack an envelope.",
          "B": "Naked viruses are stable and resistant to detergents, whereas enveloped viruses are fragile.",
          "C": "Naked viruses are readily transmitted by the fecal/oral route due to their stability; enveloped viruses are usually transmitted via body fluids.",
          "D": "The description of an \"outer lipid bilayer derived from the host cell membrane\" indicates a viral envelope. Enveloped viruses are fragile and sensitive to acid, detergents, drying, and heat.",
          "E": "Viruses can have either DNA or RNA as their genetic material. The presence of an envelope does not specify the type of nucleic acid."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient is infected with a non-enveloped virus that causes gastroenteritis. Which of the following statements accurately describes a characteristic of non-enveloped (naked) viruses that facilitates their transmission?",
        "options": {
          "A": "They are released from infected cells by budding.",
          "B": "They are sensitive to stomach acid and bile in the GI tract.",
          "C": "They possess glycoprotein spikes on their surface crucial for binding.",
          "D": "They are stable and resistant to drying.",
          "E": "They are primarily transmitted via body fluids."
        },
        "answer": "D",
        "rationales": {
          "A": "Enveloped viruses are released from infected cells by budding or lysis, while naked viruses are typically released by lysis.",
          "B": "Naked viruses are resistant to stomach acid and bile in the GI tract, which is why they are readily transmitted by the fecal/oral route.",
          "C": "Glycoprotein spikes on the surface are characteristic of enveloped viruses, not naked viruses, and play a key role in binding to host cells.",
          "D": "Naked (non-enveloped) viruses are stable and resistant to acid, detergents, drying, and heat. This stability allows them to survive in the environment and in the gastrointestinal tract, facilitating transmission by routes such as fecal/oral.",
          "E": "Enveloped viruses are primarily transmitted via body fluids, whereas naked viruses are readily transmitted by routes like fecal/oral. Steps of Viral Replication"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A research team is developing a new antiviral drug that aims to prevent a virus from entering host cells by blocking the interaction between the virus and specific host cell surface molecules. This drug is targeting which initial step of the viral replication cycle?",
        "options": {
          "A": "Uncoating",
          "B": "Replication",
          "C": "Attachment",
          "D": "Assembly",
          "E": "Release"
        },
        "answer": "C",
        "rationales": {
          "A": "Uncoating is the release of the viral genome into the host cell after entry.",
          "B": "Replication involves the synthesis of viral components and genome, which occurs after the virus has successfully entered and uncoated.",
          "C": "The first step in the viral life cycle is attachment, where the virus binds to specific receptors on target host cells. Viral attachment proteins (VAP) determine host and tissue specificity. Therefore, a drug blocking this interaction is targeting the attachment phase.",
          "D": "Assembly (or maturation) is when capsid proteins coat the viral genome to form new virions.",
          "E": "Release is when new virions exit the host cell, the final step in the cycle."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "SARS-CoV-2, the virus responsible for COVID-19, initiates infection by binding with high affinity to the ACE2 receptor on host cells. This interaction is mediated by viral attachment proteins. Which of the following viral characteristics is determined by these viral attachment proteins?",
        "options": {
          "A": "The type of nucleic acid (DNA or RNA) the virus possesses.",
          "B": "The site of viral replication within the host cell (nucleus or cytoplasm).",
          "C": "The host and tissue specificity of the virus.",
          "D": "Whether the virus is enveloped or non-enveloped.",
          "E": "The method of viral release from the host cell (budding or lysis)."
        },
        "answer": "C",
        "rationales": {
          "A": "The type of nucleic acid (DNA or RNA) is an inherent genetic characteristic of the virus, not determined by its attachment proteins.",
          "B": "The site of viral replication (nucleus or cytoplasm) is largely determined by the type of viral genome (DNA or RNA) and specific viral strategies, not by attachment proteins.",
          "C": "Viral attachment proteins (VAP) are crucial in determining the host and tissue specificity (tropism) of a virus. For instance, SARS-CoV-2's binding to ACE2 receptors dictates which cells and tissues it can infect.",
          "D": "Whether a virus is enveloped or non-enveloped is a structural characteristic of the virion, not determined by its attachment proteins, though attachment proteins are often embedded in the envelope.",
          "E": "The method of viral release (budding or lysis) is influenced by whether the virus is enveloped or naked, and other viral mechanisms, but not solely by attachment proteins. Viral Cytopathic Effects"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A pathologist is examining a tissue biopsy from a patient with a suspected viral infection. Under light microscopy, the pathologist observes large, multinucleated giant cells formed by the fusion of several infected host cells. This cytopathic effect, which facilitates cell-to-cell spread of certain viruses, is known as:?",
        "options": {
          "A": "Koilocytosis",
          "B": "Chromatin margination",
          "C": "Syncytium formation",
          "D": "Inclusion bodies",
          "E": "Pyknosis"
        },
        "answer": "C",
        "rationales": {
          "A": "Koilocytosis is cytoplasmic vacuolization, a hallmark of HPV infection.",
          "B": "Chromatin margination is when chromatin is pushed to the periphery of the nucleus, seen in infections like Parvovirus B19, HSV, and Adenovirus.",
          "C": "Syncytium formation refers to the creation of multinucleated giant cells due to viral glycoproteins promoting cell fusion. This cytopathic effect is observed in infections with viruses such as HSV, VZV, HIV, RSV, and SARS-CoV-2, and it helps the virus spread directly from cell to cell while evading the immune system.",
          "D": "Inclusion bodies are intracellular structures representing viral replication sites or capsids, which are diagnostic based on their staining and location (e.g., Negri bodies, Owl's eye, Cowdry bodies). While a syncytium might contain inclusions, the specific phenomenon described is cell fusion.",
          "E": "Pyknosis is nuclear shrinkage and condensation, a characteristic nuclear change associated with cell death (necrosis)."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A brain biopsy from a patient with rapidly progressive neurological symptoms reveals eosinophilic intracytoplasmic inclusions within neurons, specifically in the pyramidal cells of Ammon's horn. These pathognomonic inclusion bodies are characteristic of infection with which of the following viruses?",
        "options": {
          "A": "Cytomegalovirus (CMV)",
          "B": "Herpes Simplex Virus (HSV)",
          "C": "Human Papilloma Virus (HPV)",
          "D": "Rabies virus",
          "E": "Parvovirus B19"
        },
        "answer": "D",
        "rationales": {
          "A": "Cytomegalovirus (CMV) typically causes \"Owl's eye\" basophilic intranuclear inclusions.",
          "B": "Herpes Simplex Virus (HSV) typically causes \"Cowdry bodies,\" which are eosinophilic nuclear inclusions with chromatin margination.",
          "C": "Human Papilloma Virus (HPV) is characterized by koilocytosis (cytoplasmic vacuolization).",
          "D": "Negri bodies are eosinophilic intracytoplasmic inclusions found in neurons, particularly in the pyramidal cells of Ammon's horn, and are pathognomonic for Rabies virus infection.",
          "E": "Parvovirus B19 is characterized by chromatin margination, often without prominent inclusion bodies in neurons. Mechanisms of Viral Pathogenesis"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A patient infected with Hepatitis B Virus (HBV) develops symptoms related to immune complex deposition, leading to conditions like vasculitis or glomerulonephritis. This type of immunopathogenesis, where antigen-antibody complexes cause tissue damage, is classified as which type of hypersensitivity reaction?",
        "options": {
          "A": "Type I hypersensitivity",
          "B": "Type II hypersensitivity",
          "C": "Type III hypersensitivity",
          "D": "Type IV hypersensitivity",
          "E": "Cytokine storm"
        },
        "answer": "C",
        "rationales": {
          "A": "Type I hypersensitivity is IgE-mediated and causes immediate allergic reactions like anaphylaxis, not immune complex deposition.",
          "B": "Type II hypersensitivity is IgG/IgM-mediated cytotoxicity against cell surface antigens, leading to cell lysis or phagocytosis, not immune complex deposition.",
          "C": "Hepatitis B Virus (HBV) and Hepatitis C Virus (HCV) are associated with immune complex (Type III) hypersensitivity reactions. Type III hypersensitivity is characterized by antigen-antibody complexes that deposit in tissues, leading to inflammation and tissue damage, such as vasculitis or glomerulonephritis.",
          "D": "Type IV hypersensitivity is T-cell mediated and delayed, as seen in contact dermatitis or tuberculin sensitivity, not immune complex formation.",
          "E": "A cytokine storm is an exaggerated systemic inflammatory response involving massive cytokine release, associated with conditions like severe COVID-19, but it describes the overall inflammatory state, not the specific immune complex mechanism."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "SARS-CoV-2 infection can lead to severe clinical manifestations, including acute respiratory distress syndrome (ARDS) and multi-organ dysfunction. A key mechanism of pathogenesis involves the virus binding to specific host cell receptors, which then leads to a cascade of events causing widespread damage. Which of the following is a direct consequence of SARS-CoV-2 binding to its primary host receptor and the subsequent loss of receptor function?",
        "options": {
          "A": "Decreased levels of angiotensin II (Ang II), reducing vasoconstriction.",
          "B": "Upregulation of angiotensin II (Ang II), leading to vasoconstriction and alveolar damage.",
          "C": "Activation of the complement system, directly lysing host cells.",
          "D": "Induction of Type IV hypersensitivity reactions in the lungs.",
          "E": "Inhibition of viral replication, leading to rapid viral clearance."
        },
        "answer": "B",
        "rationales": {
          "A": "This is incorrect. The loss of ACE2 function leads to upregulation of Ang II, not decreased levels.",
          "B": "SARS-CoV-2 binds with high affinity to ACE2 receptors on host cells. This binding leads to the cleavage and loss of ACE2 function, which results in the upregulation of angiotensin II (Ang II). Upregulated Ang II causes vasoconstriction, coagulopathy, alveolar damage, and respiratory failure, contributing to ARDS and multi-organ dysfunction.",
          "C": "While the immune response to SARS-CoV-2 can involve complement, the primary direct consequence of receptor binding and loss of function is the dysregulation of the renin-angiotensin system, not direct complement-mediated lysis of host cells.",
          "D": "Type IV hypersensitivity reactions are T-cell mediated and delayed, and while immunopathology occurs in COVID-19, the direct effect of ACE2 binding and Ang II upregulation is not classified as Type IV hypersensitivity.",
          "E": "The binding and subsequent pathogenic cascade are mechanisms of viral infection and disease progression, not inhibition of viral replication or rapid clearance. Determinants of Viral Tropism"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "Which statement best describes viruses?",
        "options": {
          "A": "Large complex cells reproducing independently",
          "B": "Contain both DNA and RNA in genome",
          "C": "Obligate intracellular agents needing host cells for reproduction",
          "D": "Have a rigid bacterial-like cell wall",
          "E": "All viruses acquire envelopes"
        },
        "answer": "C",
        "rationales": {
          "C": "Viruses are obligate intracellular parasites that require host cells to replicate.",
          "A": "They are not cells and cannot reproduce independently.",
          "B": "They contain either DNA or RNA, never both.",
          "D": "They lack cell walls.",
          "E": "Some are naked viruses without envelopes."
        },
        "long_form": true
      },
      {
        "stem": "A patient experiences acute bronchospasm, increased vascular permeability leading to edema, and severe itching immediately after an insect sting. Which of the following preformed mediators, released from mast cells and basophils, primarily accounts for these symptoms?",
        "options": {
          "A": "Leukotrienes",
          "B": "Prostaglandins",
          "C": "Bradykinin",
          "D": "Histamine",
          "E": "Platelet-activating factor"
        },
        "answer": "D",
        "rationales": {
          "A": "Leukotrienes are synthesized after mast cell activation, not preformed, and contribute to inflammation, smooth muscle contraction, and mucus secretion. While they contribute to bronchospasm, histamine is a primary preformed mediator for the immediate symptoms listed.",
          "B": "Prostaglandins are also synthesized after mast cell activation, contributing to inflammation and smooth muscle effects, but are not preformed mediators.",
          "C": "Bradykinin is a plasma kinin, not a direct mediator released by mast cells, though it contributes to inflammation and pain.",
          "D": "Histamine is preformed in mast cells and basophils and released upon activation. It accounts for most immediate symptoms of asthma and rhinitis, specifically causing itching, sneezing, smooth muscle contraction (leading to bronchospasm), and increased vascular permeability (leading to edema and wheal formation) via H1 and H4 receptors.",
          "E": "Platelet-activating factor is a phospholipid mediator synthesized and released by various inflammatory cells, including mast cells, but is not preformed in the same way as histamine."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient with severe, refractory asthma is considered for a novel biologic therapy that targets thymic stromal lymphopoietin (TSLP), such as tezepelumab. Which of the following pathways, beyond the traditional IgE-mediated mechanism, is TSLP most directly involved in activating to contribute to allergic inflammation?",
        "options": {
          "A": "Activation of the complement classical pathway.",
          "B": "Induction of B cell differentiation into plasma cells.",
          "C": "Activation of ILC2 cells, leading to cytokine production.",
          "D": "Stimulation of cytotoxic T-lymphocyte (CTL) responses.",
          "E": "Promoting Type II IgG-mediated cytotoxic reactions."
        },
        "answer": "C",
        "rationales": {
          "A": "Activation of the complement classical pathway is initiated by antigen-antibody complexes (IgG or IgM) or directly by pathogens, not TSLP.",
          "B": "Induction of B cell differentiation into plasma cells is primarily driven by T helper cells and cytokines (e.g., IL-4, IL-5) in conjunction with antigen exposure, not directly TSLP.",
          "C": "The alarmin TSLP (thymic stromal lymphopoietin) can activate ILC2 cells that produce cytokines traditionally associated with Th2 lymphocytes. This TSLP-ILC2 pathway is a relatively new understanding in immunopathology, distinct from the Gell and Coombs classification, but crucial in allergic diseases like asthma. Tezepelumab targets TSLP to interfere with this pathway.",
          "D": "Stimulation of cytotoxic T-lymphocyte (CTL) responses is typically involved in viral infections or cancer, mediated by MHC Class I presentation, and is not a primary role of TSLP in allergic inflammation.",
          "E": "Promoting Type II IgG-mediated cytotoxic reactions involves antibodies binding to cell surface antigens, which is unrelated to TSLP's role in ILC2 activation."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A physician explains to a patient that inflammation, while often perceived negatively, is a crucial protective response. Under which of the following circumstances can inflammation become harmful to the host?",
        "options": {
          "A": "When it successfully removes necrotic cells.",
          "B": "When it is prolonged and leads to persistent infection.",
          "C": "When it initiates the process of tissue repair.",
          "D": "When it involves the initial rapid response to bacterial infection.",
          "E": "When it only causes transient redness and swelling."
        },
        "answer": "B",
        "rationales": {
          "A": "Successfully removing necrotic cells is one of the beneficial purposes of inflammation.",
          "B": "Inflammation, while beneficial in its protective role, can be harmful if it is excessive, prolonged, or inappropriate. A prolonged inflammatory response, such as in persistent infections (e.g., tuberculosis) or autoimmune diseases, can lead to chronic tissue damage and dysfunction.",
          "C": "Initiating the process of tissue repair is another beneficial purpose of inflammation.",
          "D": "The initial rapid response to bacterial infection is characteristic of acute inflammation, which is generally protective.",
          "E": "Transient redness and swelling are typical, usually localized, and non-harmful manifestations of acute inflammation. Acute Inflammation"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A 19-year-old college student develops a sore throat, fever, and difficulty swallowing. Upon examination, a dense, gray pseudomembrane is noted in the pharynx. A culture later confirms Corynebacterium diphtheriae. This type of bacterial infection typically triggers which of the following initial immune responses?",
        "options": {
          "A": "Chronic inflammation, characterized by mononuclear cells.",
          "B": "Acute inflammation, characterized by neutrophils in the tissue.",
          "C": "Granulomatous inflammation, with epithelioid histiocytes.",
          "D": "Type IV hypersensitivity, mediated by T cells.",
          "E": "Fibrotic repair, with collagen deposition."
        },
        "answer": "B",
        "rationales": {
          "A": "Chronic inflammation is a slower, prolonged response (weeks to years) characterized by mononuclear cells (lymphocytes, macrophages, plasma cells).",
          "B": "Acute inflammation is the initial, rapid, and transient response to cell injury, typically developing within minutes to hours and lasting a few days. It is characterized by the presence of neutrophils in the tissue and mediated by innate immunity. Bacterial infections, such as Corynebacterium diphtheriae, are common stimuli for acute inflammation. The pseudomembrane itself is composed of dead cells, fibrin, white blood cells (neutrophils), and organisms, indicating an acute inflammatory response.",
          "C": "Granulomatous inflammation is a specific pattern of chronic inflammation characterized by localized collections of macrophages (epithelioid histiocytes) and giant cells, often with central necrosis, typically seen in infections like tuberculosis.",
          "D": "Type IV hypersensitivity is a T-cell mediated delayed hypersensitivity response, not the immediate innate response to bacterial infection.",
          "E": "Fibrotic repair is a healing process that replaces damaged tissue with fibrous scar, occurring after the inflammatory phase."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient with Leukocyte Adhesion Deficiency Type 1 (LAD-1) presents with recurrent bacterial infections that lack pus formation. This condition is caused by an autosomal recessive defect in integrins (CD18 subunit). Which step of neutrophil extravasation is directly impaired in LAD-1?",
        "options": {
          "A": "Margination",
          "B": "Rolling",
          "C": "Stopping and adhering",
          "D": "Diapedesis",
          "E": "Chemotaxis"
        },
        "answer": "C",
        "rationales": {
          "A": "Margination is the initial step where neutrophils are pushed against the endothelium due to slowed blood flow. This is generally not impaired in LAD-1.",
          "B": "Rolling is mediated by selectins binding Sialyl-Lewis X on leukocytes, a low-affinity interaction that occurs before firm adhesion. LAD-1 does not directly affect rolling. Leukocyte adhesion deficiency type 2 (LAD-2) affects the Sialyl-Lewis X ligand, impairing rolling.",
          "C": "Leukocyte Adhesion Deficiency 1 (LAD-1) is caused by an autosomal recessive defect in integrins (specifically the CD18 subunit), which are crucial for the \"stopping and adhering\" step of neutrophil extravasation. Integrins on neutrophils form high-affinity interactions with integrin ligands (like ICAM-1) on endothelial cells, leading to firm adhesion. Without functional integrins, neutrophils cannot firmly adhere to the endothelium and thus cannot effectively leave the circulation to reach sites of infection, leading to increased circulating neutrophils in the blood and infections that lack pus formation.",
          "D": "Diapedesis (transmigration) is the squeezing of neutrophils between endothelial cells after they have adhered firmly. This step cannot occur if firm adhesion is prevented.",
          "E": "Chemotaxis is the migration of neutrophils towards chemo-attractants after exiting the circulation. This occurs after the steps affected by LAD-1. Chronic Inflammation"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A 55-year-old man with a long history of heavy smoking presents with persistent cough, dyspnea, and recurrent respiratory infections. Biopsy of his bronchial tree shows the predominance of lymphocytes, macrophages, and plasma cells in the tissue. This histopathological finding is most consistent with which type of inflammation?",
        "options": {
          "A": "Acute inflammation",
          "B": "Chronic inflammation",
          "C": "Fibrinoid necrosis",
          "D": "Coagulative necrosis",
          "E": "Neutrophilic abscess"
        },
        "answer": "B",
        "rationales": {
          "A": "Acute inflammation is a rapid, transient response characterized primarily by neutrophils.",
          "B": "Chronic inflammation is a prolonged response (weeks to years) characterized by the predominance of mononuclear cells, specifically lymphocytes, macrophages, and plasma cells. Prolonged exposure to toxic agents, such as cigarette smoke, is a known cause of chronic inflammation. The patient's history and the presence of mononuclear cells on biopsy are classic for chronic inflammation.",
          "C": "Fibrinoid necrosis is a pattern of cell death involving damage to arterial walls with fibrin deposition, associated with vasculitis and malignant hypertension.",
          "D": "Coagulative necrosis is a pattern of cell death where tissue architecture is preserved, typically caused by ischemia in solid organs (except the brain).",
          "E": "A neutrophilic abscess is a localized collection of purulent inflammatory and necrotic tissue, predominantly composed of neutrophils, indicative of acute inflammation."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient admitted to the hospital with a severe bacterial infection develops a fever. Which of the following cytokines are primarily responsible for inducing fever during a systemic inflammatory response?",
        "options": {
          "A": "IL-4 and IL-5",
          "B": "IFN-γ and TNF-β",
          "C": "IL-1 and TNF",
          "D": "IL-10 and TGF-β",
          "E": "IL-8 and Leukotriene B4"
        },
        "answer": "C",
        "rationales": {
          "A": "IL-4 and IL-5 are primarily associated with Th2 responses, promoting B cell differentiation and eosinophil activation, respectively, and are not direct pyrogens.",
          "B": "IFN-γ (interferon-gamma) and TNF-β (lymphotoxin-alpha) are mainly produced by Th1 cells and cytotoxic T cells, involved in cell-mediated immunity, but are not the primary fever-inducing cytokines in this context.",
          "C": "Fever is a systemic effect of inflammation, often induced by cytokines such as IL-1 (interleukin-1) and TNF (tumor necrosis factor). These cytokines act as pyrogens, affecting the thermoregulatory center in the hypothalamus.",
          "D": "IL-10 and TGF-β (Transforming Growth Factor-beta) are anti-inflammatory cytokines, involved in resolving inflammation and promoting healing.",
          "E": "IL-8 (a chemokine) and Leukotriene B4 are chemo-attractants for neutrophils and other inflammatory cells, but they do not directly induce fever."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A 70-year-old patient with chronic kidney disease and a persistent low-grade infection is found to have anemia. Laboratory tests show elevated C-reactive protein (an acute phase protein) and a high erythrocyte sedimentation rate (ESR). The anemia in this patient is most likely due to the action of which acute phase protein?",
        "options": {
          "A": "Fibrinogen",
          "B": "Hepcidin",
          "C": "Albumin",
          "D": "Haptoglobin",
          "E": "Ferritin"
        },
        "answer": "B",
        "rationales": {
          "A": "Fibrinogen is another acute phase protein. It binds to red blood cells, causing them to form stacks (rouleaux), which increases the erythrocyte sedimentation rate (ESR), a marker of inflammation. While it contributes to the elevated ESR, it does not directly cause anemia.",
          "B": "Hepcidin is an acute phase protein synthesized in the liver in response to inflammatory cytokines (IL-6, IL-1, TNF). Hepcidin reduces iron availability and absorption, leading to iron sequestration and ultimately contributing to the anemia of chronic disease.",
          "C": "Albumin is a negative acute phase protein, meaning its levels decrease during inflammation, and it's not directly responsible for causing anemia.",
          "D": "Haptoglobin binds free hemoglobin released from red blood cells and its levels may change in inflammation, but it's not the primary mediator of anemia of chronic disease.",
          "E": "Ferritin is an iron storage protein. Its levels are often elevated in inflammation as part of the acute phase response, but ferritin itself does not cause anemia; rather, high ferritin in the context of inflammation can indicate iron sequestration due to hepcidin's action. Tissue Repair"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A surgeon performs a clean, uninfected incision during a procedure, and the wound edges are meticulously approximated with sutures. This type of wound healing, which typically leads to minimal scar formation, is known as healing by:?",
        "options": {
          "A": "Secondary intention",
          "B": "Regeneration",
          "C": "Granulation",
          "D": "Primary intention",
          "E": "Remodeling"
        },
        "answer": "D",
        "rationales": {
          "A": "Secondary intention healing occurs when wound edges are not approximated, leading to a larger defect that fills with granulation tissue, and results in a more extensive scar.",
          "B": "Regeneration is the replacement of damaged tissue with native, identical tissue, which is ideal but not always possible, especially with deep cuts. While some epidermal regeneration occurs, the initial description refers to the macroscopic healing process of the wound.",
          "C": "Granulation tissue forms during the proliferative phase of healing and consists of fibroblasts, endothelial cells, and myofibroblasts, but it is a component of healing, not the overall type of healing.",
          "D": "Cutaneous healing by primary intention occurs when wound edges are brought together (e.g., by suturing a surgical incision) and typically leads to minimal scar. This is because there is less tissue loss and less need for extensive granulation tissue formation.",
          "E": "Remodeling is the final phase of healing where Type III collagen is replaced by Type I collagen, increasing tensile strength. It is a stage of healing, not the overall type of wound closure."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Following a myocardial infarction, the damaged heart muscle, which is a type of permanent tissue, cannot regenerate. Instead, the injured tissue is replaced by a fibrous scar. This process of tissue healing is best described as:?",
        "options": {
          "A": "Labile tissue regeneration",
          "B": "Stabile tissue regeneration",
          "C": "Repair",
          "D": "Primary intention",
          "E": "Hypertrophy"
        },
        "answer": "C",
        "rationales": {
          "A": "Labile tissues (e.g., bowel mucosa, skin) continuously recycle and regenerate. Myocardium is not labile.",
          "B": "Stabile tissues (e.g., liver) are quiescent but can regenerate when necessary. Myocardium is not stabile.",
          "C": "Repair is the replacement of damaged tissue with fibrous scar, which occurs when regenerative capacity is lost or insufficient (e.g., deep skin cuts, myocardial infarction). Permanent tissues, like myocardium and neurons, lack reparative potential and thus heal by repair with scar formation.",
          "D": "Primary intention describes a type of cutaneous healing where wound edges are approximated, resulting in minimal scar. This term specifically refers to skin wounds, not internal organ healing by scar.",
          "E": "Hypertrophy is an increase in cell size, which is a cellular adaptation, not a form of tissue repair. Abnormalities in Tissue Repair"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "A 60-year-old African American woman undergoes abdominal surgery. Several months later, she develops a raised, firm, and pruritic scar that extends beyond the original boundaries of her surgical incision. This abnormality in tissue repair, characterized by excessive collagen accumulation, is known as a:?",
        "options": {
          "A": "Contracture",
          "B": "Ulceration",
          "C": "Wound dehiscence",
          "D": "Keloid",
          "E": "Hypertrophic scar"
        },
        "answer": "D",
        "rationales": {
          "A": "Contractures are an exaggerated wound contraction process that results in deformities and can compromise joint movement, often seen after severe burns.",
          "B": "Ulceration is a local defect or excavation of a surface due to sloughing of inflamed necrotic tissue.",
          "C": "Wound dehiscence is the rupture of a wound due to increased pressure.",
          "D": "A keloid is an abnormality in tissue repair characterized by an accumulation of excessive collagen, forming a raised scar that grows beyond the original wound boundaries. It is more common in African Americans.",
          "E": "A hypertrophic scar is similar to a keloid but remains within the boundaries of the original wound, whereas a keloid extends beyond them. The description \"grows beyond the boundaries of the original wound\" is key for keloid."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient with severe full-thickness burns on their forearm develops a significant limitation in elbow extension and wrist mobility during the healing process. This complication of tissue repair, which involves an exaggerated wound contraction, is best described as:?",
        "options": {
          "A": "Wound dehiscence",
          "B": "Ulceration",
          "C": "Keloid formation",
          "D": "Contracture",
          "E": "Dysplasia"
        },
        "answer": "D",
        "rationales": {
          "A": "Wound dehiscence is the rupture of a wound due to increased pressure (e.g., vomiting, coughing).",
          "B": "Ulceration is a local defect or excavation of a surface due to sloughing of inflamed necrotic tissue.",
          "C": "Keloid formation is the accumulation of excessive collagen, forming a raised scar that grows beyond the original wound boundaries. While it's an abnormal scar, it's distinct from the exaggerated contraction that limits joint movement.",
          "D": "Contractures are an exaggeration of the normal wound contraction process, resulting in deformities of the wound and surrounding tissue, and can compromise joint movement. They are commonly seen after severe burns. The limitation in joint movement is a key indicator of a contracture.",
          "E": "Dysplasia refers to disordered cellular growth and maturation, often a precursor to neoplasia, and is not a direct complication of wound healing in this manner."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "An 80-year-old patient, who had chickenpox as a child, develops a painful, unilateral vesicular rash following a dermatomal distribution on her chest. After the rash resolves, she continues to experience severe, burning pain in the affected area for several months. This persistent pain is a well-known late complication of VZV reactivation and is referred to as:?",
        "options": {
          "A": "Post-streptococcal neuralgia",
          "B": "Herpes encephalitis",
          "C": "Post-herpetic neuralgia (PHN)",
          "D": "Trigeminal neuralgia",
          "E": "Bell's palsy"
        },
        "answer": "C",
        "rationales": {
          "A": "Post-streptococcal neuralgia is not a recognized condition; complications of streptococcal infections include rheumatic fever or glomerulonephritis.",
          "B": "Herpes encephalitis is a severe complication of HSV-1 infection affecting the brain, not a persistent pain syndrome after VZV rash.",
          "C": "The patient's initial symptoms (painful, unilateral vesicular rash in a dermatomal distribution) are characteristic of herpes zoster (shingles), which is a reactivation of latent VZV. Post-herpetic neuralgia (PHN) is the most common late complication of shingles, characterized by persisting pain in the dermatome after the rash resolves, especially common in the elderly.",
          "D": "Trigeminal neuralgia is a chronic pain condition affecting the trigeminal nerve, causing intense facial pain, but it is not a direct complication of VZV reactivation in this context; while zoster can affect the trigeminal nerve, the term PHN specifically refers to the post-rash pain.",
          "E": "Bell's palsy is an idiopathic facial nerve paralysis, not a pain syndrome associated with VZV reactivation, although VZV can cause Ramsay Hunt syndrome, which involves facial palsy and a rash. EBV and CMV Infections"
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "An HIV-positive patient with a CD4 count of 40 cells/mm³ develops progressive vision loss and ophthalmologic examination reveals a \"pizza pie\" appearance of the retina due to hemorrhage and exudates. A biopsy of the retina would most likely show characteristic basophilic intranuclear inclusions with a \"Owl's eye\" appearance. Which antiviral agent is a first-line treatment for this condition?",
        "options": {
          "A": "Acyclovir",
          "B": "Ribavirin",
          "C": "Ganciclovir",
          "D": "Foscarnet",
          "E": "Valacyclovir"
        },
        "answer": "C",
        "rationales": {
          "A": "Acyclovir is used for HSV and VZV infections, but it has much less potency against CMV compared to ganciclovir.",
          "B": "Ribavirin is used for viral hemorrhagic fevers and Hepatitis C, not CMV.",
          "C": "The clinical presentation of progressive vision loss and the \"pizza pie\" appearance of the retina, along with the characteristic \"Owl's eye\" basophilic intranuclear inclusions on histopathology, are pathognomonic for Cytomegalovirus (CMV) retinitis, an opportunistic disease occurring in immunosuppressed patients (especially HIV with low CD4 counts). Ganciclovir (and its oral prodrug valganciclovir) is a first-line antiviral for CMV infections, including retinitis.",
          "D": "Foscarnet is used for CMV infections, especially in cases where ganciclovir cannot be used or for resistant strains, but ganciclovir is typically first-line.",
          "E": "Valacyclovir is a prodrug of acyclovir, used for HSV and VZV, and is not effective for CMV. HHV-6/7 and HHV-8"
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Steps of Viral Replication": [
      {
        "stem": "A drug prevents release of viral genome into host cytoplasm. Which stage of viral life cycle is targeted?",
        "options": {
          "A": "Attachment",
          "B": "Entry",
          "C": "Uncoating",
          "D": "Replication",
          "E": "Assembly/Maturation"
        },
        "answer": "C",
        "rationales": {
          "C": "Uncoating = release of viral genome after entry. Blocking this stops replication.",
          "A": "Attachment is binding to receptors.",
          "B": "Entry is via fusion or endocytosis, not genome release.",
          "D": "Replication happens after uncoating.",
          "E": "Assembly occurs later in the cycle."
        },
        "long_form": true
      }
    ],
    "Viral Cytopathic Effects": [
      {
        "stem": "Brain biopsy shows eosinophilic intracytoplasmic inclusions (Negri bodies) in Ammon’s horn neurons. Which virus?",
        "options": {
          "A": "CMV",
          "B": "HSV",
          "C": "HPV",
          "D": "Rabies virus",
          "E": "Parvovirus B19"
        },
        "answer": "D",
        "rationales": {
          "D": "Negri bodies are pathognomonic for rabies infection.",
          "A": "CMV → owl’s eye inclusions.",
          "B": "HSV → Cowdry A inclusions.",
          "C": "HPV → koilocytes.",
          "E": "Parvovirus → margination of chromatin."
        },
        "long_form": true
      }
    ],
    "Mechanisms of Viral Pathogenesis": [
      {
        "stem": "A patient with chronic HBV develops arthralgia, rash, and glomerulonephritis. Which hypersensitivity reaction explains these systemic effects?",
        "options": {
          "A": "Type I IgE-mediated",
          "B": "Type II antibody-mediated cytotoxic",
          "C": "Type III immune complex-mediated",
          "D": "Type IV T cell–mediated",
          "E": "Direct viral cytopathic effect"
        },
        "answer": "C",
        "rationales": {
          "C": "HBV immune complexes deposit in tissues → Type III hypersensitivity.",
          "A": "Type I causes anaphylaxis/atopy, not glomerulonephritis.",
          "B": "Type II causes cytotoxic diseases (AIHA).",
          "D": "Type IV causes DTH/contact dermatitis.",
          "E": "Direct cytopathic effect is distinct from immune complex–driven disease."
        },
        "long_form": true
      }
    ],
    "Determinants of Viral Tropism": [
      {
        "stem": "A virus infects respiratory epithelium but not liver cells. Which viral component determines this tropism?",
        "options": {
          "A": "Type of nucleic acid",
          "B": "Presence of envelope",
          "C": "Viral attachment proteins (VAP)",
          "D": "Host ribosomal machinery",
          "E": "Viral uncoating enzymes"
        },
        "answer": "C",
        "rationales": {
          "C": "Viral attachment proteins (VAPs) bind specific host receptors and determine tropism.",
          "A": "Nucleic acid type determines replication strategy, not cell specificity.",
          "B": "Envelope influences stability and transmission, not tropism.",
          "D": "Ribosomes are universal, not cell-type selective.",
          "E": "Uncoating occurs after tropism has been established."
        },
        "long_form": true
      }
    ],
    "Mediators of Hypersensitivity": [
      {
        "stem": "A 12-year-old boy with severe asthma frequently experiences exacerbations characterized by intense inflammation, persistent bronchoconstriction, and excessive mucus secretion. His physicians decide to prescribe an antileukotriene medication. The mechanism of action of this medication will primarily target which of the following?",
        "options": {
          "A": "Blocking H1 histamine receptors to reduce itching and edema.",
          "B": "Inhibiting cyclooxygenase pathway to prevent prostaglandin synthesis.",
          "C": "Antagonizing CysLT1 receptors to reduce smooth muscle contraction and mucus secretion.",
          "D": "Decreasing the production of IgE antibodies.",
          "E": "Suppressing T-cell mediated delayed hypersensitivity reactions."
        },
        "answer": "C",
        "rationales": {
          "A": "Blocking H1 histamine receptors is the mechanism of antihistamines, which primarily target itching, sneezing, and acute edema, but are less effective for persistent bronchoconstriction and mucus secretion in asthma compared to leukotriene antagonists.",
          "B": "Inhibiting the cyclooxygenase pathway prevents prostaglandin synthesis and is the mechanism of NSAIDs (e.g., aspirin), which can trigger asthma in some individuals, and is not the target of antileukotrienes.",
          "C": "Leukotrienes are synthesized upon mast cell activation and bind to CysLT1 receptors, promoting inflammation, smooth muscle contraction, and mucus secretion. Antileukotrienes are specific CysLT1 receptor antagonists widely used clinically to counter these effects. Therefore, an antileukotriene medication would primarily target these receptors to alleviate the patient's symptoms of bronchoconstriction and mucus secretion.",
          "D": "Decreasing the production of IgE antibodies is the mechanism of monoclonal antibodies like omalizumab (anti-IgE), a different class of therapeutic intervention.",
          "E": "Suppressing T-cell mediated delayed hypersensitivity reactions is the role of corticosteroids or other immunosuppressants and is not the specific target of antileukotriene therapy. Therapeutic Interventions"
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Gell & Coombs Hypersensitivity Types": {
      "items": [
        {
          "stem": "A patient with severe chronic urticaria that is unresponsive to conventional antihistamines is considered for treatment with omalizumab. What is the primary immunologic mechanism targeted by omalizumab?",
          "options": {
            "A": "Inhibition of leukotriene synthesis.",
            "B": "Blockade of H1 histamine receptors.",
            "C": "Neutralization of IgE antibodies.",
            "D": "Suppression of T-cell activation.",
            "E": "Inhibition of mast cell degranulation by non-IgE mechanisms."
          },
          "answer": "C",
          "rationales": {
            "A": "Inhibition of leukotriene synthesis is achieved by zileuton or leukotriene receptor antagonists (e.g., montelukast), not omalizumab.",
            "B": "Blockade of H1 histamine receptors is the mechanism of antihistamines, which the patient has already failed.",
            "C": "Omalizumab is a monoclonal antibody that binds free IgE, lowering circulating IgE and preventing its interaction with FcεRI on mast cells and basophils; this reduces IgE-mediated activation.",
            "D": "Global T-cell suppression is the domain of corticosteroids or calcineurin inhibitors, not omalizumab.",
            "E": "Omalizumab targets IgE-dependent pathways; it does not directly block non–IgE-mediated mast cell activation."
          },
          "difficulty": "Easy",
          "long_form": true
        }
      ]
    },
    "Chronic Inflammation": {
      "items": [
        {
          "stem": "A patient is diagnosed with tuberculosis based on clinical symptoms and imaging. A lung biopsy reveals localized collections of epithelioid histiocytes, giant cells, and central caseous necrosis. This specific type of chronic inflammatory response is known as a:?",
          "options": {
            "A": "Neutrophilic microabscess",
            "B": "Lymphoid follicle",
            "C": "Granuloma",
            "D": "Suppurative inflammation",
            "E": "Fibrotic scar"
          },
          "answer": "C",
          "rationales": {
            "A": "Microabscesses are acute neutrophil-predominant collections.",
            "B": "Lymphoid follicles are lymphocyte aggregates; they lack epithelioid histiocytes/giant cells.",
            "C": "Granulomas are organized aggregates of activated macrophages (epithelioid histiocytes) often with giant cells; caseation is classic for TB.",
            "D": "Suppurative (purulent) inflammation features pus and neutrophils.",
            "E": "A fibrotic scar is a healing outcome, not the inflammatory lesion itself."
          },
          "difficulty": "Medium",
          "long_form": true
        }
      ]
    },
    "HSV Clinical Features and Diagnosis": {
      "items": [
        {
          "stem": "A 68-year-old man is admitted with acute onset headache, fever, behavioral changes, and focal seizures. MRI shows temporal lobe inflammation. CSF reveals mixed pleocytosis and elevated protein. Which laboratory test is most definitive for confirming herpes encephalitis?",
          "options": {
            "A": "Viral culture of the cerebrospinal fluid",
            "B": "Serum HSV IgM antibodies",
            "C": "HSV PCR of cerebrospinal fluid",
            "D": "Electroencephalogram (EEG)",
            "E": "Tzanck smear from a skin lesion"
          },
          "answer": "C",
          "rationales": {
            "A": "CSF culture is insensitive and slow for HSV encephalitis.",
            "B": "Serology does not confirm CNS disease and may be negative in reactivation.",
            "C": "CSF HSV PCR is highly sensitive and specific and is the diagnostic test of choice.",
            "D": "EEG may show temporal abnormalities but is not specific for HSV.",
            "E": "Tzanck smear pertains to mucocutaneous lesions, not encephalitis."
          },
          "difficulty": "Medium",
          "long_form": true
        }
      ]
    },
    "Oncogenic Viruses (Thai)": {
      "Definition and Mechanisms": [
        {
          "stem": "Certain viruses are classified as oncogenic because they can cause persistent infections leading to uncontrolled cell proliferation and malignant transformation. Which of the following is a primary mechanism by which oncogenic viruses contribute to cancer development?",
          "options": {
            "A": "Causing acute, lytic infections that rapidly kill host cells",
            "B": "Encoding enzymes that degrade host cell DNA without integration",
            "C": "Integrating their genome into host DNA, potentially activating proto-oncogenes",
            "D": "Inducing a strong, transient immune response that clears the virus",
            "E": "Promoting cellular senescence and programmed cell death"
          },
          "answer": "C",
          "rationales": {
            "A": "Rapid lysis removes cells; oncogenesis requires persistence and dysregulated growth.",
            "B": "DNA degradation alone does not explain malignant transformation.",
            "C": "Integration near proto-oncogenes or interference with tumor suppressors can drive uncontrolled proliferation.",
            "D": "Oncogenic viruses typically evade clearance and persist.",
            "E": "They subvert, not promote, apoptosis to favor survival/proliferation."
          },
          "difficulty": "Easy",
          "long_form": true
        },
        {
          "stem": "Epstein-Barr Virus (EBV) is associated with several human cancers, including Burkitt lymphoma. A key viral protein, LMP-1, contributes to EBV oncogenesis by mimicking a constitutively active cellular receptor. Which effect of LMP-1 promotes B-cell growth and prevents apoptosis?",
          "options": {
            "A": "Inhibition of cellular cyclin D expression",
            "B": "Activation of BCL2",
            "C": "Binding and inactivation of p53",
            "D": "Inactivation of RB",
            "E": "Blocking interferon signaling"
          },
          "answer": "B",
          "rationales": {
            "A": "Cyclin D activation (not inhibition) supports proliferation and is driven by EBNA-2, not LMP-1.",
            "B": "LMP-1 signals like CD40 → NF-κB upregulation of BCL2, enhancing survival.",
            "C": "p53 inactivation is characteristic of HPV E6, not EBV LMP-1.",
            "D": "RB inactivation is characteristic of HPV E7.",
            "E": "Interferon pathway interference is described with other herpesviral proteins, not the key LMP-1 oncogenic action."
          },
          "difficulty": "Easy",
          "long_form": true
        },
        {
          "stem": "Human Papilloma Virus (HPV) high-risk types (e.g., 16, 18) drive malignant transformation primarily via which viral early genes and targets?",
          "options": {
            "A": "E6 activates p53; E7 activates RB",
            "B": "E6 inactivates p53; E7 inactivates RB",
            "C": "L1 and L2 integrate and activate proto-oncogenes",
            "D": "LMP-1 mimics CD40 and EBNA-2 activates cyclin D",
            "E": "vIL-6 and vFLIP block apoptosis in keratinocytes"
          },
          "answer": "B",
          "rationales": {
            "A": "Directionality is reversed; E6/E7 inactivate tumor suppressors.",
            "B": "Correct: E6 → p53 degradation; E7 → RB inactivation, promoting cell cycle progression.",
            "C": "L1/L2 are capsid proteins, not the drivers of oncogenesis.",
            "D": "These are EBV proteins, not HPV.",
            "E": "These are HHV-8 (Kaposi) proteins, not HPV."
          },
          "difficulty": "Medium",
          "long_form": true
        },
        {
          "stem": "Which mechanism explains how oncogenic viruses cause cancer?",
          "options": {
            "A": "Rapid cell lysis leading to necrosis",
            "B": "Destroy tumor suppressors in all infected cells",
            "C": "Integrate genome near proto-oncogenes or encode oncogenes",
            "D": "Stimulate immune system to attack healthy cells",
            "E": "Cause transient infections that resolve without changes"
          },
          "answer": "C",
          "rationales": {
            "C": "Persistent infection with integration or expression of oncogenes dysregulates growth.",
            "A": "Cytolysis alone does not drive malignant transformation.",
            "B": "Effects vary by cell and context; not universal or immediate.",
            "D": "Autoimmunity is not the core mechanism of viral oncogenesis.",
            "E": "Persistence, not transience, underlies oncogenesis."
          },
          "long_form": true
        }
      ],
      "DNA Oncogenic Viruses": [
        {
          "stem": "A 28-year-old woman has cervical carcinoma strongly linked to persistent infection with which DNA virus?",
          "options": {
            "A": "EBV",
            "B": "HBV",
            "C": "HPV",
            "D": "HHV-8",
            "E": "CMV"
          },
          "answer": "C",
          "rationales": {
            "C": "High-risk HPV (16, 18) account for ~70% of cervical carcinoma.",
            "A": "EBV is linked to Burkitt lymphoma, Hodgkin lymphoma, and nasopharyngeal carcinoma.",
            "B": "HBV is associated with hepatocellular carcinoma.",
            "D": "HHV-8 is associated with Kaposi sarcoma.",
            "E": "CMV is not classified as oncogenic."
          },
          "long_form": true
        }
      ],
      "RNA Oncogenic Viruses": [
        {
          "stem": "Which RNA virus is known to cause adult T-cell leukemia/lymphoma?",
          "options": {
            "A": "HCV",
            "B": "Influenza A",
            "C": "HTLV-1",
            "D": "Rotavirus",
            "E": "HIV"
          },
          "answer": "C",
          "rationales": {
            "C": "HTLV-1 (a retrovirus) causes adult T-cell leukemia/lymphoma.",
            "A": "HCV is linked to hepatocellular carcinoma.",
            "B": "Influenza is not oncogenic.",
            "D": "Rotavirus causes gastroenteritis.",
            "E": "HIV increases cancer risk via immunosuppression but is not directly oncogenic."
          },
          "long_form": true
        }
      ],
      "Oncogenesis and Immune Suppression": [
        {
          "stem": "In HPV oncogenesis, which viral early genes inactivate p53 and RB?",
          "options": {
            "A": "E1 and E2",
            "B": "E6 and E7",
            "C": "L1 and L2",
            "D": "LMP-1 and EBNA-2",
            "E": "vIL-6 and vFLIP"
          },
          "answer": "B",
          "rationales": {
            "B": "E6 targets p53; E7 targets RB → loss of cell cycle control.",
            "A": "E1/E2 regulate replication/maintenance, not tumor suppressor inactivation.",
            "C": "L1/L2 are structural capsid proteins.",
            "D": "EBV proteins, not HPV.",
            "E": "HHV-8 proteins, not HPV."
          },
          "long_form": true
        }
      ]
    },
    "HIV Anti-Retrovirals (Anderson)": {
      "Classes of Antiretroviral Drugs": [
        {
          "stem": "A newly diagnosed HIV patient is prescribed a regimen that includes tenofovir disoproxil fumarate and emtricitabine. These two drugs belong to which class of antiretroviral agents?",
          "options": {
            "A": "Nucleoside/Nucleotide Reverse Transcriptase Inhibitors (NRTIs)",
            "B": "Non-Nucleoside Reverse Transcriptase Inhibitors (NNRTIs)",
            "C": "Integrase Strand Transfer Inhibitors (INSTIs)",
            "D": "Protease Inhibitors (PIs)",
            "E": "Capsid Inhibitors"
          },
          "answer": "A",
          "rationales": {
            "A": "Tenofovir and emtricitabine are NRTIs that act as nucleotide/nucleoside analogues, causing chain termination when incorporated by reverse transcriptase.",
            "B": "NNRTIs (e.g., efavirenz) allosterically inhibit RT but are not incorporated into DNA.",
            "C": "INSTIs (e.g., dolutegravir) block integration of viral DNA.",
            "D": "PIs inhibit HIV protease and virion maturation.",
            "E": "Capsid inhibitors (e.g., lenacapavir) target capsid assembly/transport, not RT."
          },
          "difficulty": "Easy",
          "long_form": true
        },
        {
          "stem": "A 50-year-old male with long-standing HIV on older therapy develops fatigue, peripheral neuropathy, and facial/limb lipoatrophy. Which antiretroviral class is most classically associated with this toxicity profile?",
          "options": {
            "A": "Older NRTIs (e.g., stavudine, didanosine)",
            "B": "Integrase Strand Transfer Inhibitors (e.g., dolutegravir)",
            "C": "Protease Inhibitors (e.g., atazanavir)",
            "D": "Non-Nucleoside Reverse Transcriptase Inhibitors (e.g., efavirenz)",
            "E": "CCR5 Antagonists (e.g., maraviroc)"
          },
          "answer": "A",
          "rationales": {
            "A": "‘d-drug’ NRTIs (stavudine, didanosine) are linked to lipoatrophy and peripheral neuropathy via mitochondrial toxicity.",
            "B": "INSTIs are generally well tolerated; weight gain and insomnia can occur, but not classically neuropathy/lipoatrophy.",
            "C": "PIs are linked to insulin resistance and lipodystrophy (central adiposity), less so to lipoatrophy/neuropathy.",
            "D": "NNRTIs can cause CNS effects and rash; not the classic cause of neuropathy/lipoatrophy.",
            "E": "CCR5 antagonists may cause URTIs and hepatotoxicity but not neuropathy/lipoatrophy."
          },
          "difficulty": "Easy",
          "long_form": true
        },
        {
          "stem": "A patient’s new HIV drug binds reverse transcriptase directly without being incorporated into DNA. Which class?",
          "options": {
            "A": "NRTIs",
            "B": "NNRTIs",
            "C": "INSTIs",
            "D": "Protease inhibitors",
            "E": "Coreceptor antagonists"
          },
          "answer": "B",
          "rationales": {
            "B": "NNRTIs directly and allosterically inhibit reverse transcriptase.",
            "A": "NRTIs require phosphorylation and are incorporated to terminate DNA.",
            "C": "INSTIs inhibit strand transfer by integrase.",
            "D": "PIs block proteolytic processing of gag-pol polyproteins.",
            "E": "CCR5 antagonists block viral entry at the co-receptor, not RT."
          },
          "long_form": true
        }
      ],
      "Principles of ART": [
        {
          "stem": "What is the primary goal of ART for HIV patients?",
          "options": {
            "A": "Induce allergic response",
            "B": "Achieve undetectable viral load to prevent replication/transmission",
            "C": "Directly kill infected CD4 T cells",
            "D": "Permanently eradicate HIV",
            "E": "Prevent opportunistic infections only"
          },
          "answer": "B",
          "rationales": {
            "B": "Sustained virologic suppression preserves immune function and achieves U=U (undetectable = untransmittable).",
            "A": "Not a therapeutic aim.",
            "C": "ART suppresses replication; it is not cytotoxic to host cells.",
            "D": "Eradication is limited by latent reservoirs.",
            "E": "OI prevention follows from viral suppression; it is not the sole goal."
          },
          "long_form": true
        }
      ],
      "Side Effects of Antiretrovirals": [
        {
          "stem": "A patient on ART develops Fanconi syndrome and rising creatinine. Which drug is most likely responsible?",
          "options": {
            "A": "Abacavir",
            "B": "Dolutegravir",
            "C": "Tenofovir alafenamide (TAF)",
            "D": "Tenofovir disoproxil fumarate (TDF)",
            "E": "Rilpivirine"
          },
          "answer": "D",
          "rationales": {
            "D": "TDF can cause proximal tubular toxicity (Fanconi syndrome) and bone mineral loss.",
            "A": "Abacavir is linked to HLA-B*57:01–associated hypersensitivity.",
            "B": "Dolutegravir can raise creatinine via OCT2 inhibition without true nephrotoxicity.",
            "C": "TAF has a better renal and bone safety profile than TDF.",
            "E": "Rilpivirine is associated with rash and mood changes."
          },
          "long_form": true
        }
      ],
      "Treatment as Prevention (TasP)": [
        {
          "stem": "A provider explains to an HIV-positive patient with a sustained undetectable viral load on ART that they cannot sexually transmit HIV. What is this concept called?",
          "options": {
            "A": "Post-exposure prophylaxis (PEP)",
            "B": "Immune reconstitution inflammatory syndrome (IRIS)",
            "C": "Pre-exposure prophylaxis (PrEP)",
            "D": "Treatment as Prevention (TasP) / U=U",
            "E": "Rapid initiation (RI)"
          },
          "answer": "D",
          "rationales": {
            "D": "Treatment as Prevention (U=U): sustained undetectable viral load prevents sexual transmission.",
            "A": "PEP is for HIV-negative individuals after exposure.",
            "B": "IRIS is inflammatory unmasking after starting ART.",
            "C": "PrEP is for HIV-negative individuals before exposure.",
            "E": "Rapid initiation refers to quickly starting ART after diagnosis."
          },
          "long_form": true
        }
      ]
    },
    "Pathology of Cell Injury, Cell Death & Adaptations (Samra)": {
      "Cell Injury: Reversible vs Irreversible": [
        {
          "stem": "A myocardial biopsy shows cellular swelling, fatty change, and intact nuclear chromatin. Which type of injury is this?",
          "options": {
            "A": "Irreversible injury",
            "B": "Reversible injury",
            "C": "Necrosis",
            "D": "Apoptosis",
            "E": "Cellular adaptation"
          },
          "answer": "B",
          "rationales": {
            "A": "Irreversible injury shows membrane rupture and nuclear breakdown.",
            "B": "Cell swelling and fatty change with intact nuclei indicate reversible injury.",
            "C": "Necrosis is irreversible cell death with membrane disruption.",
            "D": "Apoptosis is programmed cell death with apoptotic bodies.",
            "E": "Adaptations are non-injurious adjustments to stress."
          },
          "long_form": true
        },
        {
          "stem": "A hepatocyte shows severe mitochondrial swelling, plasma membrane rupture, and karyolysis. Which type of cell injury is present?",
          "options": {
            "A": "Reversible injury",
            "B": "Irreversible injury",
            "C": "Autophagy",
            "D": "Apoptosis",
            "E": "Cellular adaptation"
          },
          "answer": "B",
          "rationales": {
            "A": "Reversible injury does not feature membrane rupture or karyolysis.",
            "B": "Membrane damage and nuclear dissolution define irreversible injury.",
            "C": "Autophagy is a survival mechanism, not necrosis.",
            "D": "Apoptosis is controlled cell death without membrane rupture.",
            "E": "Adaptation represents nonlethal change to stress."
          },
          "long_form": true
        }
      ],
      "Causes of Cell Injury": [
        {
          "stem": "A 52-year-old man with chronic alcoholism develops cirrhosis. Which category of cell injury does this represent?",
          "options": {
            "A": "Physical agent",
            "B": "Chemical agent",
            "C": "Hypoxia",
            "D": "Infectious agent",
            "E": "Immunologic injury"
          },
          "answer": "B",
          "rationales": {
            "A": "Physical agents: trauma, temperature extremes, radiation.",
            "B": "Ethanol is a chemical toxin causing hepatocellular injury and fibrosis.",
            "C": "Hypoxia involves reduced oxygen delivery/utilization.",
            "D": "Infectious agents include bacteria, viruses, parasites.",
            "E": "Immunologic injury involves autoimmunity or hypersensitivity."
          },
          "long_form": true
        },
        {
          "stem": "A patient with severe pneumonia develops hypoxemia, resulting in ATP depletion and lactic acidosis. This mechanism of injury is best explained as:",
          "options": {
            "A": "Physical agent",
            "B": "Chemical agent",
            "C": "Hypoxic injury",
            "D": "Genetic defect",
            "E": "Nutritional imbalance"
          },
          "answer": "C",
          "rationales": {
            "A": "Physical agents cause mechanical/thermal damage, not hypoxemia.",
            "B": "Chemical injury is toxin/drug related.",
            "C": "Hypoxia impairs oxidative phosphorylation → ↓ATP → metabolic derangements.",
            "D": "Genetic defects cause inherited metabolic or structural issues.",
            "E": "Nutritional imbalance involves deficiency or excess of nutrients."
          },
          "long_form": true
        }
      ],
      "Adaptations & Tissue Regeneration": [
        {
          "stem": "Which of the following best describes the liver’s capacity to regenerate after partial hepatectomy?",
          "options": {
            "A": "Labile tissue",
            "B": "Permanent tissue",
            "C": "Stabile tissue",
            "D": "Dysplasia",
            "E": "Neoplasia"
          },
          "answer": "C",
          "rationales": {
            "A": "Labile tissues continuously proliferate (e.g., skin, gut epithelium).",
            "B": "Permanent tissues (neurons, myocardium) lack regenerative capacity.",
            "C": "Liver is a classic stabile tissue: quiescent cells re-enter the cycle to restore mass.",
            "D": "Dysplasia is disordered growth, not normal regeneration.",
            "E": "Neoplasia is uncontrolled proliferation, not regulated regeneration."
          },
          "difficulty": "Hard",
          "long_form": true
        },
        {
          "stem": "A patient with chronic hypertension develops increased left ventricular wall thickness due to larger cardiomyocytes. This adaptive increase in individual cell size is called:",
          "options": {
            "A": "Atrophy",
            "B": "Hyperplasia",
            "C": "Hypertrophy",
            "D": "Metaplasia",
            "E": "Apoptosis"
          },
          "answer": "C",
          "rationales": {
            "A": "Atrophy is a decrease in cell size and/or number.",
            "B": "Hyperplasia is an increase in cell number (not typical of myocardium).",
            "C": "Hypertrophy = increased cell size, the adaptation seen in permanent tissues like myocardium.",
            "D": "Metaplasia is replacement of one mature cell type by another.",
            "E": "Apoptosis is programmed cell death."
          },
          "difficulty": "Medium",
          "long_form": true
        }
      ],
      "Necrosis vs Apoptosis": [
        {
          "stem": "A biopsy shows cell shrinkage, nuclear fragmentation into apoptotic bodies, and intact membranes. Which process is this?",
          "options": {
            "A": "Necrosis",
            "B": "Apoptosis",
            "C": "Autophagy",
            "D": "Reversible injury",
            "E": "Adaptation"
          },
          "answer": "B",
          "rationales": {
            "A": "Necrosis = membrane rupture + inflammation.",
            "B": "Apoptosis = programmed death, no inflammation.",
            "C": "Autophagy = lysosomal digestion.",
            "D": "Reversible = swelling, fatty change.",
            "E": "Adaptation = physiologic change."
          },
          "long_form": true
        },
        {
          "stem": "A patient with ischemic infarction of the kidney shows eosinophilic cytoplasm and loss of nuclei, but preserved cell outlines. Which cell death pattern is this?",
          "options": {
            "A": "Coagulative necrosis",
            "B": "Apoptosis",
            "C": "Caseous necrosis",
            "D": "Liquefactive necrosis",
            "E": "Fat necrosis"
          },
          "answer": "A",
          "rationales": {
            "A": "Coagulative = preserved architecture, loss of nuclei, hypoxia.",
            "B": "Apoptosis = programmed nuclear fragmentation.",
            "C": "Caseous = cheesy, granulomatous infections.",
            "D": "Liquefactive = pus, brain infarcts.",
            "E": "Fat necrosis = enzymatic fat breakdown."
          },
          "long_form": true
        }
      ],
      "Intracellular Accumulations": [
        {
          "stem": "A 45-year-old man with chronic hepatitis shows hepatocytes filled with lipid vacuoles. This is an example of:",
          "options": {
            "A": "Hemosiderosis",
            "B": "Lipofuscin accumulation",
            "C": "Steatosis",
            "D": "Amyloidosis",
            "E": "Hyaline change"
          },
          "answer": "C",
          "rationales": {
            "A": "Hemosiderosis = iron overload.",
            "B": "Lipofuscin = wear-and-tear pigment.",
            "C": "Steatosis = fatty change, lipid vacuoles in cytoplasm.",
            "D": "Amyloid = extracellular misfolded protein.",
            "E": "Hyaline = nonspecific glassy protein accumulation."
          },
          "long_form": true
        },
        {
          "stem": "A cardiac biopsy shows golden-brown perinuclear granules that stain positive for iron. Which accumulation is this?",
          "options": {
            "A": "Glycogen",
            "B": "Lipofuscin",
            "C": "Hemosiderin",
            "D": "Cholesterol",
            "E": "Calcium"
          },
          "answer": "C",
          "rationales": {
            "A": "Glycogen = clear vacuoles, PAS positive.",
            "B": "Lipofuscin = brown, perinuclear, aging pigment.",
            "C": "Hemosiderin = golden-brown, iron storage.",
            "D": "Cholesterol = foamy macrophages.",
            "E": "Calcium = basophilic, crystalline deposits."
          },
          "long_form": true
        }
      ],
      "Cellular Adaptations": [
        {
          "stem": "A 60-year-old alcoholic has hepatocytes with large clear lipid vacuoles. Which adaptation?",
          "options": {
            "A": "Hypertrophy",
            "B": "Hyperplasia",
            "C": "Steatosis (fatty change)",
            "D": "Metaplasia",
            "E": "Dysplasia"
          },
          "answer": "C",
          "rationales": {
            "C": "Fatty change (steatosis) is accumulation of lipid vacuoles in hepatocytes.",
            "A": "Hypertrophy = increased cell size.",
            "B": "Hyperplasia = increased cell number.",
            "D": "Metaplasia = one cell type replaced by another.",
            "E": "Dysplasia = disordered growth, premalignant."
          },
          "long_form": true
        }
      ],
      "Cellular Aging": [
        {
          "stem": "Which of the following is a hallmark of cellular aging?",
          "options": {
            "A": "Telomere shortening",
            "B": "Telomerase activation",
            "C": "Increased regenerative capacity",
            "D": "Enhanced DNA repair",
            "E": "Reduced free radical damage"
          },
          "answer": "A",
          "rationales": {
            "A": "Telomere shortening = replicative senescence.",
            "B": "Telomerase activation = immortality (cancer).",
            "C": "Aging reduces regenerative capacity.",
            "D": "DNA repair decreases with aging.",
            "E": "Free radical damage increases with aging."
          },
          "long_form": true
        },
        {
          "stem": "A 90-year-old woman’s fibroblasts show decreased telomere length and reduced mitotic activity. This represents:",
          "options": {
            "A": "Apoptosis",
            "B": "Necrosis",
            "C": "Senescence",
            "D": "Autophagy",
            "E": "Dysplasia"
          },
          "answer": "C",
          "rationales": {
            "A": "Apoptosis = programmed cell death.",
            "B": "Necrosis = uncontrolled death.",
            "C": "Senescence = permanent cell cycle arrest from aging.",
            "D": "Autophagy = survival mechanism, not senescence.",
            "E": "Dysplasia = disordered growth, precancerous."
          },
          "long_form": true
        }
      ],
      "Cell Injury (Reversible vs Irreversible)": [
        {
          "stem": "A patient with TIA has reversible injury in neurons. What is the earliest ultrastructural change?",
          "options": {
            "A": "Nuclear pyknosis",
            "B": "Cell membrane rupture",
            "C": "Ribosomal detachment with decreased protein synthesis",
            "D": "Nuclear karyorrhexis",
            "E": "Mitochondrial rupture"
          },
          "answer": "C",
          "rationales": {
            "C": "Reversible injury = cell swelling, ribosomal detachment, decreased protein synthesis.",
            "A": "Pyknosis = irreversible nuclear change.",
            "B": "Membrane rupture = irreversible necrosis.",
            "D": "Karyorrhexis = nuclear fragmentation, irreversible.",
            "E": "Mitochondrial rupture = irreversible."
          },
          "long_form": true
        }
      ],
      "Chronic Inflammation": [
        {
          "stem": "A patient with TB has granulomatous lung lesions with cheese-like necrosis. What type?",
          "options": {
            "A": "Coagulative",
            "B": "Liquefactive",
            "C": "Caseous",
            "D": "Fat",
            "E": "Fibrinoid"
          },
          "answer": "C",
          "rationales": {
            "C": "Caseous necrosis = TB hallmark, with cheese-like material and granulomas.",
            "A": "Coagulative = infarcts in most tissues.",
            "B": "Liquefactive = brain infarcts, abscesses.",
            "D": "Fat = pancreatitis, trauma.",
            "E": "Fibrinoid = immune vasculitis."
          },
          "long_form": true
        }
      ],
      "Apoptosis and Necrosis": [
        {
          "stem": "A biopsy shows cell shrinkage, chromatin condensation, apoptotic bodies. Which pathway?",
          "options": {
            "A": "Apoptosis",
            "B": "Necrosis",
            "C": "Autophagy",
            "D": "Oncosis",
            "E": "Pyroptosis"
          },
          "answer": "A",
          "rationales": {
            "A": "Apoptosis = programmed cell death with shrinkage and apoptotic bodies.",
            "B": "Necrosis = swelling, lysis, inflammation.",
            "C": "Autophagy = survival mechanism under stress.",
            "D": "Oncosis = cell swelling, not apoptosis.",
            "E": "Pyroptosis = caspase-1/IL-1β–driven inflammatory death."
          },
          "long_form": true
        }
      ],
      "Non-HIV Anti-viral Agents (Fisher)": {
        "Anti-Herpesvirus Agents": [
          {
            "stem": "A 22-year-old man with genital herpes is treated with a guanosine analogue activated by viral thymidine kinase. Which drug is this?",
            "options": {
              "A": "Ganciclovir",
              "B": "Acyclovir",
              "C": "Cidofovir",
              "D": "Foscarnet",
              "E": "Ribavirin"
            },
            "answer": "B",
            "rationales": {
              "A": "Ganciclovir = CMV, more toxic.",
              "B": "Acyclovir = HSV/VZV, activated by viral thymidine kinase.",
              "C": "Cidofovir = resistant HSV/CMV.",
              "D": "Foscarnet = pyrophosphate analogue, used for resistant cases.",
              "E": "Ribavirin = RSV, hepatitis C."
            },
            "long_form": true
          },
          {
            "stem": "A transplant patient develops CMV retinitis. Which drug is most appropriate?",
            "options": {
              "A": "Acyclovir",
              "B": "Valacyclovir",
              "C": "Ganciclovir",
              "D": "Oseltamivir",
              "E": "Baloxavir"
            },
            "answer": "C",
            "rationales": {
              "A": "Acyclovir less effective vs CMV.",
              "B": "Valacyclovir = prodrug of acyclovir.",
              "C": "Ganciclovir = potent vs CMV retinitis.",
              "D": "Oseltamivir = influenza drug.",
              "E": "Baloxavir = influenza polymerase inhibitor."
            },
            "long_form": true
          }
        ],
        "Anti-Influenza Agents": [
          {
            "stem": "A patient with influenza is prescribed a neuraminidase inhibitor. Which drug works by preventing viral release?",
            "options": {
              "A": "Oseltamivir",
              "B": "Baloxavir",
              "C": "Remdesivir",
              "D": "Ribavirin",
              "E": "Entecavir"
            },
            "answer": "A",
            "rationales": {
              "A": "Oseltamivir = neuraminidase inhibitor.",
              "B": "Baloxavir = polymerase inhibitor.",
              "C": "Remdesivir = RNA polymerase inhibitor (coronavirus).",
              "D": "Ribavirin = RSV/hepatitis C.",
              "E": "Entecavir = HBV."
            },
            "long_form": true
          },
          {
            "stem": "A COPD patient is treated with inhaled zanamivir but develops bronchospasm. Best alternative?",
            "options": {
              "A": "Continue zanamivir",
              "B": "Switch to oseltamivir",
              "C": "Add ribavirin",
              "D": "Use acyclovir",
              "E": "Start interferon"
            },
            "answer": "B",
            "rationales": {
              "A": "Would worsen bronchospasm.",
              "B": "Oseltamivir oral = safe in COPD.",
              "C": "Ribavirin = not influenza.",
              "D": "Acyclovir = HSV drug.",
              "E": "Interferon not standard influenza treatment."
            },
            "long_form": true
          }
        ],
        "Anti-Hepatitis Agents": [
          {
            "stem": "A patient with chronic HBV is treated with a guanosine analogue causing chain termination. Which drug is this?",
            "options": {
              "A": "Tenofovir",
              "B": "Entecavir",
              "C": "Lamivudine",
              "D": "Interferon-α",
              "E": "Sofosbuvir"
            },
            "answer": "B",
            "rationales": {
              "A": "Tenofovir = nucleotide analogue for HBV/HIV.",
              "B": "Entecavir = guanosine analogue for HBV.",
              "C": "Lamivudine = cytidine analogue for HBV/HIV.",
              "D": "IFN-α = immunomodulator, not chain terminator.",
              "E": "Sofosbuvir = HCV polymerase inhibitor."
            },
            "long_form": true
          },
          {
            "stem": "A patient with chronic hepatitis B develops nephrotoxicity and bone loss on therapy. Which drug is responsible?",
            "options": {
              "A": "Entecavir",
              "B": "Tenofovir",
              "C": "Ganciclovir",
              "D": "Oseltamivir",
              "E": "Baloxavir"
            },
            "answer": "B",
            "rationales": {
              "A": "Entecavir = no renal/bone toxicity.",
              "B": "Tenofovir = renal toxicity + osteoporosis.",
              "C": "Ganciclovir = CMV drug.",
              "D": "Oseltamivir = influenza drug.",
              "E": "Baloxavir = influenza drug."
            },
            "long_form": true
          }
        ],
        "Other Antiviral Agents": [
          {
            "stem": "A patient with severe COVID-19 receives an adenosine analogue that inhibits RNA polymerase. Which drug is this?",
            "options": {
              "A": "Ribavirin",
              "B": "Remdesivir",
              "C": "Baloxavir",
              "D": "Foscarnet",
              "E": "Entecavir"
            },
            "answer": "B",
            "rationales": {
              "A": "Ribavirin = purine analogue, RSV/HCV.",
              "B": "Remdesivir = nucleotide analogue, COVID.",
              "C": "Baloxavir = influenza polymerase inhibitor.",
              "D": "Foscarnet = CMV/HSV.",
              "E": "Entecavir = HBV."
            },
            "long_form": true
          },
          {
            "stem": "A patient with Lassa fever is treated with a purine analogue that inhibits viral RNA synthesis. Which drug is this?",
            "options": {
              "A": "Ribavirin",
              "B": "Remdesivir",
              "C": "Cidofovir",
              "D": "Oseltamivir",
              "E": "Ganciclovir"
            },
            "answer": "A",
            "rationales": {
              "A": "Ribavirin = purine analogue, used for arenaviruses like Lassa.",
              "B": "Remdesivir = coronavirus drug.",
              "C": "Cidofovir = cytidine analogue.",
              "D": "Oseltamivir = influenza drug.",
              "E": "Ganciclovir = CMV drug."
            },
            "long_form": true
          }
        ],
        "Acyclovir and Related Drugs": [
          {
            "stem": "A patient with recurrent genital HSV starts acyclovir. Which viral enzyme is required for activation?",
            "options": {
              "A": "Reverse transcriptase",
              "B": "Viral thymidine kinase",
              "C": "DNA polymerase",
              "D": "Neuraminidase",
              "E": "Integrase"
            },
            "answer": "B",
            "rationales": {
              "B": "Acyclovir requires phosphorylation by viral thymidine kinase for activation.",
              "A": "RT is HIV enzyme, not HSV.",
              "C": "DNA polymerase is target, not activator.",
              "D": "Neuraminidase is influenza enzyme.",
              "E": "Integrase is HIV enzyme."
            },
            "long_form": true
          }
        ],
        "EBV and CMV Infections": [
          {
            "stem": "A kidney transplant patient with CMV infection is started on ganciclovir. Which is the most important adverse effect?",
            "options": {
              "A": "Nephrotoxicity",
              "B": "Bone marrow suppression",
              "C": "Neurotoxicity",
              "D": "Crystalluria",
              "E": "Ototoxicity"
            },
            "answer": "B",
            "rationales": {
              "B": "Ganciclovir → bone marrow suppression (neutropenia, thrombocytopenia).",
              "A": "Nephrotoxicity is more with foscarnet, cidofovir.",
              "C": "Not major toxicity of ganciclovir.",
              "D": "Crystalluria = acyclovir toxicity.",
              "E": "Ototoxicity = aminoglycosides."
            },
            "long_form": true
          },
          {
            "stem": "A patient with ganciclovir-resistant CMV retinitis is started on foscarnet. Which adverse effect is most characteristic?",
            "options": {
              "A": "Hypocalcemia, hypomagnesemia, seizures",
              "B": "Neutropenia",
              "C": "Fanconi syndrome",
              "D": "Lactic acidosis",
              "E": "Hemolytic anemia"
            },
            "answer": "A",
            "rationales": {
              "A": "Foscarnet → electrolyte abnormalities (Ca, Mg, K) → seizures.",
              "B": "Seen with ganciclovir.",
              "C": "Seen with cidofovir and TDF.",
              "D": "Seen with NRTIs (esp. older ones).",
              "E": "Seen with ribavirin or dapsone, not foscarnet."
            },
            "long_form": true
          }
        ],
        "Influenza Antivirals": [
          {
            "stem": "A 7-year-old girl with influenza is prescribed oseltamivir. Which viral protein does it target?",
            "options": {
              "A": "Hemagglutinin",
              "B": "Neuraminidase",
              "C": "RNA polymerase",
              "D": "M2 proton channel",
              "E": "Nucleoprotein"
            },
            "answer": "B",
            "rationales": {
              "B": "Oseltamivir inhibits neuraminidase → prevents viral release from cells.",
              "A": "Hemagglutinin = viral attachment.",
              "C": "RNA polymerase is not oseltamivir’s target.",
              "D": "M2 channel is targeted by amantadine (obsolete).",
              "E": "Nucleoprotein is not drug target."
            },
            "long_form": true
          }
        ]
      }
    }
  },
  "Pathology of Cell Injury, Cell Death & Adaptations (Samra)": {
    "Molecular Mechanisms and Causes of Cell Injury": [
      {
        "stem": "A patient suffers from ischemia due to arterial occlusion. Which organelle’s dysfunction is most central in initiating irreversible cellular injury?",
        "options": {
          "A": "Endoplasmic reticulum",
          "B": "Golgi apparatus",
          "C": "Mitochondria",
          "D": "Lysosomes",
          "E": "Ribosomes"
        },
        "answer": "C",
        "rationales": {
          "C": "Mitochondria are the most critical targets in cell injury; hypoxia leads to ATP depletion and impaired oxidative phosphorylation.",
          "A": "The ER is affected but not the primary initiator.",
          "B": "The Golgi is disrupted secondarily, not central.",
          "D": "Lysosomes contribute via enzyme release later in necrosis.",
          "E": "Ribosomes detach early but are not the main trigger."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "Increased cytosolic calcium contributes to cell damage through which of the following mechanisms?",
        "options": {
          "A": "Stimulates ribosomal protein synthesis",
          "B": "Inhibits free radical formation",
          "C": "Activates phospholipases and proteases",
          "D": "Promotes DNA repair enzymes",
          "E": "Decreases mitochondrial permeability"
        },
        "answer": "C",
        "rationales": {
          "C": "Calcium activates destructive enzymes like phospholipases and proteases, damaging membranes and mitochondria.",
          "A": "Protein synthesis decreases in injury, not increases.",
          "B": "Free radicals are increased, not inhibited.",
          "D": "DNA repair is impaired, not promoted.",
          "E": "Calcium actually increases mitochondrial permeability."
        },
        "difficulty": "Easy",
        "long_form": true
      }
    ],
    "Hypoxic Injury": [
      {
        "stem": "A patient develops hypoxia due to severe pneumonia. Which immediate metabolic change occurs in their cells?",
        "options": {
          "A": "Increased oxidative phosphorylation",
          "B": "Decreased glycolysis",
          "C": "Increased lactic acid production",
          "D": "Decreased free ionized calcium",
          "E": "Increased intracellular pH"
        },
        "answer": "C",
        "rationales": {
          "C": "Hypoxia forces anaerobic glycolysis, producing lactic acid and lowering pH.",
          "A": "Oxidative phosphorylation decreases.",
          "B": "Glycolysis increases, not decreases.",
          "D": "Calcium increases, not decreases.",
          "E": "pH decreases due to lactic acid accumulation."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which of the following is NOT a cause of hypoxia?",
        "options": {
          "A": "Ischemia",
          "B": "Anemia",
          "C": "Carbon monoxide poisoning",
          "D": "Increased oxidative phosphorylation",
          "E": "Respiratory infection"
        },
        "answer": "D",
        "rationales": {
          "D": "Increased oxidative phosphorylation is normal metabolism, not a cause of hypoxia.",
          "A": "Ischemia reduces oxygen delivery.",
          "B": "Anemia reduces oxygen-carrying capacity.",
          "C": "CO poisoning prevents oxygen binding to hemoglobin.",
          "E": "Respiratory infection impairs oxygenation."
        },
        "difficulty": "Easy",
        "long_form": true
      }
    ],
    "Reversible Cell Injury": [
      {
        "stem": "Which light microscopy finding is most characteristic of reversible cell injury?",
        "options": {
          "A": "Karyorrhexis",
          "B": "Pale cytoplasm with swelling",
          "C": "Nuclear dissolution",
          "D": "Necrotic debris",
          "E": "Eosinophilic cytoplasm"
        },
        "answer": "B",
        "rationales": {
          "B": "Reversible injury shows swelling with pale cytoplasm ('cloudy swelling').",
          "A": "Karyorrhexis indicates irreversible injury.",
          "C": "Nuclear dissolution is irreversible necrosis.",
          "D": "Necrotic debris reflects irreversible cell death.",
          "E": "Eosinophilia occurs with necrosis."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "Which ultrastructural change is an early hallmark of reversible cell injury?",
        "options": {
          "A": "Mitochondrial cristae destruction",
          "B": "Ribosome detachment from ER",
          "C": "Massive lysosomal rupture",
          "D": "Chromatin fragmentation",
          "E": "Nuclear dissolution"
        },
        "answer": "B",
        "rationales": {
          "B": "Reversible injury shows ER swelling with ribosome detachment.",
          "A": "Cristae destruction is irreversible.",
          "C": "Lysosomal rupture is irreversible.",
          "D": "Chromatin fragmentation occurs in necrosis.",
          "E": "Nuclear dissolution = necrosis."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Irreversible Cell Injury (Necrosis)": [
      {
        "stem": "Which biochemical hallmark best distinguishes necrosis from reversible cell injury?",
        "options": {
          "A": "ATP depletion",
          "B": "Mitochondrial swelling with preserved cristae",
          "C": "Chromatin clumping",
          "D": "Massive lysosomal enzyme release",
          "E": "Ribosome detachment"
        },
        "answer": "D",
        "rationales": {
          "D": "Lysosomal enzyme release into the cytoplasm defines irreversible necrosis.",
          "A": "ATP depletion occurs in both reversible and irreversible injury.",
          "B": "Preserved cristae = reversible injury.",
          "C": "Chromatin clumping can be reversible.",
          "E": "Ribosome detachment is reversible."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "Which of the following is a classic ultrastructural marker of irreversible cell injury?",
        "options": {
          "A": "Mitochondrial swelling with intact cristae",
          "B": "Plasma membrane blebbing",
          "C": "Severe mitochondrial swelling with cristae destruction",
          "D": "Cellular swelling with vacuoles",
          "E": "Detachment of ribosomes"
        },
        "answer": "C",
        "rationales": {
          "C": "Destruction of mitochondrial cristae marks irreversibility.",
          "A": "Intact cristae indicates reversibility.",
          "B": "Membrane blebbing can be reversible.",
          "D": "Cell swelling is reversible.",
          "E": "Ribosome detachment is reversible."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Nuclear Changes Associated with Cell Death": [
      {
        "stem": "Which nuclear change is defined by condensation of chromatin into a small, dark mass?",
        "options": {
          "A": "Pyknosis",
          "B": "Karyorrhexis",
          "C": "Karyolysis",
          "D": "Apoptosis",
          "E": "Necroptosis"
        },
        "answer": "A",
        "rationales": {
          "A": "Pyknosis = shrinkage and condensation of chromatin.",
          "B": "Karyorrhexis = fragmentation.",
          "C": "Karyolysis = dissolution.",
          "D": "Apoptosis is a broader program, not a specific morphology.",
          "E": "Necroptosis is a programmed form of necrosis."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which sequence of nuclear changes is correct in cell death?",
        "options": {
          "A": "Karyolysis → Pyknosis → Karyorrhexis",
          "B": "Pyknosis → Karyorrhexis → Karyolysis",
          "C": "Karyorrhexis → Pyknosis → Karyolysis",
          "D": "Pyknosis → Karyolysis → Karyorrhexis",
          "E": "Karyolysis → Karyorrhexis → Pyknosis"
        },
        "answer": "B",
        "rationales": {
          "B": "The correct sequence is Pyknosis → Karyorrhexis → Karyolysis.",
          "A": "Wrong order.",
          "C": "Wrong order.",
          "D": "Wrong order.",
          "E": "Wrong order."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Cytoplasmic Changes Associated with Cell Death": [
      {
        "stem": "Which histologic feature is most typical of necrotic cytoplasm?",
        "options": {
          "A": "Basophilia due to RNA abundance",
          "B": "Deep eosinophilia due to protein denaturation",
          "C": "Clear cytoplasm due to glycogen",
          "D": "Multinucleation due to syncytia",
          "E": "Foamy cytoplasm due to lipids"
        },
        "answer": "B",
        "rationales": {
          "B": "Necrosis causes denaturation of proteins and loss of RNA, making cells pink (eosinophilic).",
          "A": "RNA is lost, not increased.",
          "C": "Clear glycogen is unrelated.",
          "D": "Syncytia occur in viral infections.",
          "E": "Foamy cytoplasm = lipid storage diseases."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Why do necrotic cells stain more eosinophilic (pink) on H&E?",
        "options": {
          "A": "Increased RNA content",
          "B": "Protein denaturation and loss of RNA",
          "C": "Increased glycogen storage",
          "D": "Nuclear basophilia",
          "E": "Mitochondrial proliferation"
        },
        "answer": "B",
        "rationales": {
          "B": "Necrotic cytoplasm has protein denaturation + loss of RNA, enhancing eosin affinity.",
          "A": "RNA is reduced.",
          "C": "Glycogen doesn’t cause eosinophilia.",
          "D": "Basophilia is nuclear, not cytoplasmic.",
          "E": "Mitochondria decrease in function, not proliferate."
        },
        "difficulty": "Easy",
        "long_form": true
      }
    ],
    "Five Patterns of Cellular Necrosis": [
      {
        "stem": "Which pattern of necrosis is most classically associated with ischemia of solid organs like the heart or kidney?",
        "options": {
          "A": "Coagulative necrosis",
          "B": "Liquefactive necrosis",
          "C": "Caseous necrosis",
          "D": "Fat necrosis",
          "E": "Fibrinoid necrosis"
        },
        "answer": "A",
        "rationales": {
          "A": "Coagulative necrosis is typical of ischemia in most organs except the brain.",
          "B": "Liquefactive occurs in the brain or abscesses.",
          "C": "Caseous is classically TB.",
          "D": "Fat necrosis occurs in pancreatitis or trauma to fat.",
          "E": "Fibrinoid necrosis occurs in vessel walls."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "A patient with tuberculosis has a lung lesion with 'cheese-like' necrosis. What is the best description of this pattern?",
        "options": {
          "A": "Coagulative necrosis",
          "B": "Liquefactive necrosis",
          "C": "Caseous necrosis",
          "D": "Fat necrosis",
          "E": "Fibrinoid necrosis"
        },
        "answer": "C",
        "rationales": {
          "C": "Caseous necrosis is described as 'cream cheese-like' and is classically TB.",
          "A": "Coagulative preserves tissue outline.",
          "B": "Liquefactive is liquefied tissue.",
          "D": "Fat necrosis is chalky deposits in fat.",
          "E": "Fibrinoid is immune complex in vessels."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ]
  },
  "Oncogenic Viruses (Thai)": {
    "Oncogenic Virus Characteristics and Mechanisms of Cancer": [
      {
        "stem": "Which mechanism allows oncogenic viruses to convert host proto-oncogenes into active oncogenes?",
        "options": {
          "A": "Blocking protein synthesis",
          "B": "Insertion of viral genome near proto-oncogenes",
          "C": "Inducing apoptosis",
          "D": "Enhancing mitochondrial ATP production",
          "E": "Triggering lysosomal rupture"
        },
        "answer": "B",
        "rationales": {
          "B": "Viral genome integration can activate proto-oncogenes or disrupt tumor suppressors.",
          "A": "Protein synthesis inhibition is not central here.",
          "C": "Apoptosis suppression favors cancer, not induction.",
          "D": "ATP production is unrelated.",
          "E": "Lysosomal rupture is a necrosis feature, not viral oncogenesis."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "Persistent infection with oncogenic viruses contributes to cancer primarily through which process?",
        "options": {
          "A": "Chronic inflammation alone",
          "B": "Rapid viral clearance",
          "C": "Continuous host cell proliferation",
          "D": "Reduced viral latency",
          "E": "Enhanced apoptosis of infected cells"
        },
        "answer": "C",
        "rationales": {
          "C": "Persistent infection drives uncontrolled cell proliferation and transformation.",
          "A": "Inflammation contributes, but persistence is key.",
          "B": "Rapid clearance prevents oncogenesis.",
          "D": "Latency is not reduced in oncogenic viruses.",
          "E": "Enhanced apoptosis would prevent cancer."
        },
        "difficulty": "Easy",
        "long_form": true
      }
    ],
    "Regulation of Cell Cycle": [
      {
        "stem": "Which tumor suppressor gene is known as the 'guardian of the genome'?",
        "options": {
          "A": "p53",
          "B": "RB",
          "C": "MYC",
          "D": "BCL2",
          "E": "Cyclin D"
        },
        "answer": "A",
        "rationales": {
          "A": "p53 halts division or induces apoptosis when DNA is damaged.",
          "B": "RB also regulates, but p53 is the guardian.",
          "C": "MYC is a proto-oncogene, not a suppressor.",
          "D": "BCL2 is anti-apoptotic.",
          "E": "Cyclin D is a growth-promoting factor."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "How do oncogenic viruses promote cell cycle progression?",
        "options": {
          "A": "Inactivating proto-oncogenes",
          "B": "Mutating mitochondrial DNA",
          "C": "Interfering with tumor suppressors like RB and p53",
          "D": "Increasing lysosomal enzymes",
          "E": "Enhancing oxidative phosphorylation"
        },
        "answer": "C",
        "rationales": {
          "C": "Viruses inactivate p53/RB, removing brakes on proliferation.",
          "A": "They activate, not inactivate, proto-oncogenes.",
          "B": "Mitochondrial DNA is not the main target.",
          "D": "Lysosomes are not central here.",
          "E": "Metabolism changes occur but not via oxidative phosphorylation."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Major Oncogenic DNA Viruses": [
      {
        "stem": "Which virus is responsible for most cases of hepatocellular carcinoma worldwide?",
        "options": {
          "A": "Epstein-Barr virus",
          "B": "Human papillomavirus",
          "C": "Human herpesvirus-8",
          "D": "Hepatitis B virus",
          "E": "Cytomegalovirus"
        },
        "answer": "D",
        "rationales": {
          "D": "HBV accounts for ~80% of HCC cases globally.",
          "A": "EBV causes lymphomas and nasopharyngeal carcinoma.",
          "B": "HPV causes cervical and anogenital cancers.",
          "C": "HHV-8 causes Kaposi sarcoma.",
          "E": "CMV is not oncogenic."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "Which HPV types are considered 'high-risk' for cervical carcinoma?",
        "options": {
          "A": "1, 2, 3",
          "B": "6, 11",
          "C": "16, 18, 31, 33",
          "D": "42, 43, 44",
          "E": "56, 58, 70"
        },
        "answer": "C",
        "rationales": {
          "C": "HPV 16, 18, 31, 33 are classic high-risk oncogenic strains.",
          "A": "Low-risk cutaneous wart strains.",
          "B": "Low-risk genital wart strains.",
          "D": "Not major oncogenic strains.",
          "E": "Some are implicated, but not the main ones."
        },
        "difficulty": "Easy",
        "long_form": true
      }
    ],
    "Major Human Oncogenic RNA Viruses": [
      {
        "stem": "Human T-cell Leukemia Virus-1 (HTLV-1) is associated with which malignancy?",
        "options": {
          "A": "Hepatocellular carcinoma",
          "B": "Burkitt lymphoma",
          "C": "Adult T-cell leukemia/lymphoma",
          "D": "Kaposi sarcoma",
          "E": "Cervical carcinoma"
        },
        "answer": "C",
        "rationales": {
          "C": "HTLV-1 causes adult T-cell leukemia/lymphoma.",
          "A": "HBV/HCV cause HCC.",
          "B": "Burkitt = EBV.",
          "D": "Kaposi = HHV-8.",
          "E": "Cervical = HPV."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which RNA virus is a major cause of hepatocellular carcinoma via chronic infection?",
        "options": {
          "A": "HIV",
          "B": "HCV",
          "C": "HTLV-2",
          "D": "Rabies",
          "E": "Influenza"
        },
        "answer": "B",
        "rationales": {
          "B": "HCV causes chronic hepatitis leading to cirrhosis and HCC.",
          "A": "HIV causes immunodeficiency, not HCC.",
          "C": "HTLV-2 is less oncogenic.",
          "D": "Rabies causes encephalitis, not cancer.",
          "E": "Influenza is not oncogenic."
        },
        "difficulty": "Easy",
        "long_form": true
      }
    ]
  },
  "HIV Anti-Retrovirals (Anderson)": {
    "Goals of Antiretroviral Therapy (ART)": [
      {
        "stem": "Which phrase summarizes the public health message 'U=U' in HIV therapy?",
        "options": {
          "A": "Undetectable = Untransmittable",
          "B": "Unstable = Untreatable",
          "C": "Universal = Unnecessary",
          "D": "Unique = Unclear",
          "E": "Underdiagnosed = Unavoidable"
        },
        "answer": "A",
        "rationales": {
          "A": "Achieving undetectable viral load makes HIV untransmittable.",
          "B": "Incorrect, HIV is treatable.",
          "C": "Universal testing/treatment is necessary.",
          "D": "Not a relevant phrase.",
          "E": "Diagnosis and treatment prevent transmission."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which is NOT a primary goal of ART?",
        "options": {
          "A": "Virologic suppression",
          "B": "Immunologic recovery",
          "C": "Clinical improvement",
          "D": "Societal/financial benefit",
          "E": "Induction of permanent viral eradication"
        },
        "answer": "E",
        "rationales": {
          "E": "ART suppresses but does not eradicate HIV.",
          "A": "Suppression is a core goal.",
          "B": "CD4 recovery is essential.",
          "C": "Improved survival is key.",
          "D": "Prevention and reduced spread benefit society."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Considerations for Starting ART": [
      {
        "stem": "Which of the following is a contraindication to immediate ART initiation?",
        "options": {
          "A": "High viral load",
          "B": "Low CD4 count",
          "C": "Cryptococcal meningitis",
          "D": "HIV resistance testing pending",
          "E": "No comorbidities"
        },
        "answer": "C",
        "rationales": {
          "C": "ART is delayed in cryptococcal or TB meningitis to prevent IRIS.",
          "A": "High viral load strengthens ART need.",
          "B": "Low CD4 count favors urgent ART.",
          "D": "Treatment should start while resistance testing occurs.",
          "E": "No comorbidities = proceed with ART."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "Which factor is NOT routinely considered before starting ART?",
        "options": {
          "A": "Comorbidities",
          "B": "Baseline viral load",
          "C": "ART naivety",
          "D": "Viral tropism test",
          "E": "HIV resistance profile"
        },
        "answer": "D",
        "rationales": {
          "D": "Viral tropism testing is required for CCR5 antagonists, not routine ART initiation.",
          "A": "Comorbidities affect drug choice.",
          "B": "Baseline viral load helps predict success.",
          "C": "Naivety affects regimen choice.",
          "E": "Resistance testing is essential."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Nucleoside Reverse Transcriptase Inhibitors (NRTIs)": [
      {
        "stem": "Which NRTI requires HLA-B*5701 testing before use?",
        "options": {
          "A": "Tenofovir disoproxil fumarate",
          "B": "Tenofovir alafenamide",
          "C": "Lamivudine",
          "D": "Abacavir",
          "E": "Zidovudine"
        },
        "answer": "D",
        "rationales": {
          "D": "Abacavir hypersensitivity is associated with HLA-B*5701.",
          "A": "TDF causes renal/bone toxicity.",
          "B": "TAF has fewer renal effects.",
          "C": "Lamivudine does not require testing.",
          "E": "Zidovudine is used in perinatal prophylaxis."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which class-wide side effect is most associated with older NRTIs?",
        "options": {
          "A": "Mitochondrial toxicity",
          "B": "CNS side effects",
          "C": "Nephrotoxicity",
          "D": "QT prolongation",
          "E": "Cytokine release syndrome"
        },
        "answer": "A",
        "rationales": {
          "A": "Older NRTIs often cause mitochondrial toxicity, lactic acidosis, and myopathy.",
          "B": "CNS effects = NNRTIs (efavirenz).",
          "C": "Renal = TDF, not class-wide.",
          "D": "QT prolongation = fostemsavir.",
          "E": "Cytokine release = OKT3, not NRTIs."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Non-Nucleoside Reverse Transcriptase Inhibitors (NNRTIs)": [
      {
        "stem": "Which NNRTI is linked to vivid dreams and CNS side effects?",
        "options": {
          "A": "Efavirenz",
          "B": "Doravirine",
          "C": "Rilpivirine",
          "D": "Nevirapine",
          "E": "Maraviroc"
        },
        "answer": "A",
        "rationales": {
          "A": "Efavirenz causes CNS side effects and vivid dreams.",
          "B": "Doravirine is well tolerated.",
          "C": "Rilpivirine needs food and can cause depression.",
          "D": "Nevirapine causes hepatotoxicity.",
          "E": "Maraviroc is not an NNRTI."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which property best describes NNRTIs?",
        "options": {
          "A": "Compete with nucleotides",
          "B": "Directly bind reverse transcriptase",
          "C": "Require phosphorylation to be active",
          "D": "Block HIV protease",
          "E": "Prevent viral integration"
        },
        "answer": "B",
        "rationales": {
          "B": "NNRTIs directly bind reverse transcriptase at a non-nucleotide site.",
          "A": "This describes NRTIs.",
          "C": "Phosphorylation = NRTIs.",
          "D": "Protease inhibitors block protease.",
          "E": "Integration = INSTIs."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Integrase Strand Transfer Inhibitors (INSTIs)": [
      {
        "stem": "Which is a unique advantage of INSTIs compared to other ART classes?",
        "options": {
          "A": "High barrier to resistance",
          "B": "Require pharmacokinetic boosting",
          "C": "Cause mitochondrial toxicity",
          "D": "Cause vivid dreams",
          "E": "Target CCR5 receptor"
        },
        "answer": "A",
        "rationales": {
          "A": "INSTIs are potent, well tolerated, with high resistance barriers.",
          "B": "Boosting is needed for PIs or elvitegravir, not class-wide.",
          "C": "Mitochondrial toxicity = NRTIs.",
          "D": "CNS side effects = NNRTIs.",
          "E": "CCR5 blockade = maraviroc."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "What is the mechanism of INSTIs?",
        "options": {
          "A": "Prevent HIV entry",
          "B": "Block reverse transcriptase",
          "C": "Inhibit integration of viral DNA into host genome",
          "D": "Block viral protease cleavage",
          "E": "Neutralize viral envelope"
        },
        "answer": "C",
        "rationales": {
          "C": "INSTIs block integration of viral DNA into host chromosomes.",
          "A": "Entry inhibitors block CCR5/CD4.",
          "B": "Reverse transcriptase inhibitors = NRTI/NNRTI.",
          "D": "Protease inhibitors block maturation.",
          "E": "No ARV neutralizes viral envelope."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Protease Inhibitors (PIs)": [
      {
        "stem": "Which is the mechanism of action of protease inhibitors (PIs)?",
        "options": {
          "A": "Block reverse transcriptase",
          "B": "Prevent viral DNA integration",
          "C": "Inhibit cleavage of viral polyproteins",
          "D": "Bind CCR5 receptor",
          "E": "Induce host apoptosis"
        },
        "answer": "C",
        "rationales": {
          "C": "PIs prevent cleavage of viral polyproteins, blocking maturation of infectious virions.",
          "A": "Reverse transcriptase = NRTIs/NNRTIs.",
          "B": "Integration = INSTIs.",
          "D": "CCR5 = entry inhibitors.",
          "E": "Apoptosis is not PI mechanism."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which metabolic adverse effects are most associated with long-term PI use?",
        "options": {
          "A": "Lactic acidosis and pancreatitis",
          "B": "Lipodystrophy and insulin resistance",
          "C": "Bone marrow suppression",
          "D": "Severe CNS side effects",
          "E": "Renal tubular acidosis"
        },
        "answer": "B",
        "rationales": {
          "B": "PIs cause dyslipidemia, insulin resistance, and lipodystrophy.",
          "A": "Lactic acidosis = older NRTIs.",
          "C": "Bone marrow suppression = zidovudine.",
          "D": "CNS side effects = efavirenz.",
          "E": "Renal = tenofovir."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "CCR5 Antagonist (Maraviroc)": [
      {
        "stem": "Maraviroc prevents HIV infection by binding which molecule?",
        "options": {
          "A": "CD4 receptor",
          "B": "CXCR4 receptor",
          "C": "CCR5 receptor",
          "D": "gp120",
          "E": "Reverse transcriptase"
        },
        "answer": "C",
        "rationales": {
          "C": "Maraviroc blocks CCR5, preventing HIV entry.",
          "A": "CD4 binding is blocked by ibalizumab.",
          "B": "CXCR4 is not Maraviroc’s target.",
          "D": "gp120 binds host receptors.",
          "E": "Reverse transcriptase = NRTI/NNRTI."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Before prescribing maraviroc, which test is required?",
        "options": {
          "A": "HLA-B*5701",
          "B": "Viral tropism assay",
          "C": "Resistance genotype",
          "D": "Serum creatinine",
          "E": "Bone density scan"
        },
        "answer": "B",
        "rationales": {
          "B": "Maraviroc only works with CCR5-tropic virus; tropism testing is mandatory.",
          "A": "HLA-B*5701 is for abacavir.",
          "C": "Resistance testing is separate.",
          "D": "Renal function is not a contraindication.",
          "E": "Bone density relates to tenofovir."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Post-Attachment Inhibitor (Ibalizumab)": [
      {
        "stem": "Ibalizumab blocks HIV entry by binding to which receptor?",
        "options": {
          "A": "CD4",
          "B": "CCR5",
          "C": "CXCR4",
          "D": "gp41",
          "E": "gp120"
        },
        "answer": "A",
        "rationales": {
          "A": "Ibalizumab binds CD4, preventing conformational change needed for entry.",
          "B": "CCR5 = maraviroc.",
          "C": "CXCR4 is not the target.",
          "D": "gp41 = fusion inhibitors.",
          "E": "gp120 is viral ligand."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which group of patients is ibalizumab typically reserved for?",
        "options": {
          "A": "ART-naïve",
          "B": "Pregnant women",
          "C": "Children under 5",
          "D": "Heavily treatment-experienced, multidrug-resistant HIV",
          "E": "HIV with cryptococcal meningitis"
        },
        "answer": "D",
        "rationales": {
          "D": "Ibalizumab is used for salvage therapy in multidrug-resistant HIV.",
          "A": "Not first-line for naïve patients.",
          "B": "No special role in pregnancy.",
          "C": "Not specific for children.",
          "E": "Not indicated in cryptococcal meningitis."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Attachment Inhibitor (Fostemsavir)": [
      {
        "stem": "What is the mechanism of fostemsavir?",
        "options": {
          "A": "Blocks gp41 fusion",
          "B": "Binds gp120 to prevent attachment to CD4",
          "C": "Blocks CCR5 receptor",
          "D": "Blocks integrase enzyme",
          "E": "Blocks reverse transcriptase"
        },
        "answer": "B",
        "rationales": {
          "B": "Fostemsavir binds gp120, preventing HIV attachment to CD4.",
          "A": "gp41 inhibitors = enfuvirtide.",
          "C": "CCR5 blocker = maraviroc.",
          "D": "Integrase = INSTIs.",
          "E": "Reverse transcriptase = NRTIs/NNRTIs."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which unique adverse effect is associated with fostemsavir?",
        "options": {
          "A": "QT prolongation",
          "B": "CNS toxicity",
          "C": "Mitochondrial toxicity",
          "D": "Lactic acidosis",
          "E": "Osteopenia"
        },
        "answer": "A",
        "rationales": {
          "A": "Fostemsavir may prolong QT interval.",
          "B": "CNS toxicity = efavirenz.",
          "C": "Mitochondrial = NRTIs.",
          "D": "Lactic acidosis = older NRTIs.",
          "E": "Osteopenia = tenofovir."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Capsid Inhibitor (Lenacapavir)": [
      {
        "stem": "What is the target of lenacapavir?",
        "options": {
          "A": "gp120",
          "B": "gp41",
          "C": "Integrase enzyme",
          "D": "Capsid protein",
          "E": "Reverse transcriptase"
        },
        "answer": "D",
        "rationales": {
          "D": "Lenacapavir is a capsid inhibitor blocking assembly/disassembly.",
          "A": "gp120 = fostemsavir.",
          "B": "gp41 = enfuvirtide.",
          "C": "Integrase = INSTIs.",
          "E": "Reverse transcriptase = NRTI/NNRTI."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which feature makes lenacapavir distinct among ARVs?",
        "options": {
          "A": "Oral daily dosing",
          "B": "Once-yearly dosing potential",
          "C": "Mitochondrial toxicity",
          "D": "Neuropsychiatric effects",
          "E": "Renal toxicity"
        },
        "answer": "B",
        "rationales": {
          "B": "Lenacapavir is long-acting, potentially dosed every 6 months.",
          "A": "It is not daily oral like most ARVs.",
          "C": "Not class effect.",
          "D": "Not typical of lenacapavir.",
          "E": "Renal toxicity = tenofovir."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Treatment Strategies": [
      {
        "stem": "What is the preferred initial ART regimen for most patients?",
        "options": {
          "A": "PI + NNRTI",
          "B": "INSTI + 2 NRTIs",
          "C": "Dual PI regimen",
          "D": "Single NRTI",
          "E": "Maraviroc monotherapy"
        },
        "answer": "B",
        "rationales": {
          "B": "INSTI + 2 NRTIs is first-line due to potency and tolerance.",
          "A": "PI + NNRTI is not standard.",
          "C": "Dual PI is not used.",
          "D": "Single NRTI is inadequate.",
          "E": "Maraviroc monotherapy is ineffective."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which factor may allow use of 2-drug regimens instead of standard triple therapy?",
        "options": {
          "A": "Pregnancy",
          "B": "Active opportunistic infection",
          "C": "High viral load",
          "D": "Suppressed viral load and stable CD4 count",
          "E": "HLA-B*5701 positivity"
        },
        "answer": "D",
        "rationales": {
          "D": "Stable, suppressed patients may use 2-drug regimens (e.g., dolutegravir/lamivudine).",
          "A": "Pregnancy requires full regimen.",
          "B": "Opportunistic infection requires robust regimen.",
          "C": "High load needs triple therapy.",
          "E": "HLA-B*5701 guides abacavir, not regimen size."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Immune Reconstitution Inflammatory Syndrome (IRIS)": [
      {
        "stem": "What best explains the pathogenesis of IRIS?",
        "options": {
          "A": "Direct HIV replication",
          "B": "Excessive immune response to latent pathogens after ART",
          "C": "Drug hypersensitivity reaction",
          "D": "Mitochondrial toxicity",
          "E": "Viral mutation under therapy"
        },
        "answer": "B",
        "rationales": {
          "B": "IRIS occurs when immune recovery causes exaggerated response to existing infections.",
          "A": "Viral load decreases on ART.",
          "C": "Not a drug allergy.",
          "D": "Not mitochondrial issue.",
          "E": "Resistance mutation = failure, not IRIS."
        },
        "difficulty": "Medium",
        "long_form": true
      },
      {
        "stem": "Which opportunistic infection is most commonly associated with IRIS?",
        "options": {
          "A": "Kaposi sarcoma",
          "B": "Cryptococcus",
          "C": "Cytomegalovirus",
          "D": "Toxoplasma",
          "E": "Pneumocystis jirovecii"
        },
        "answer": "B",
        "rationales": {
          "B": "Cryptococcus is most often associated with IRIS, especially meningitis.",
          "A": "Kaposi may flare but less common.",
          "C": "CMV less frequent.",
          "D": "Toxoplasma less common.",
          "E": "PCP is not classic for IRIS."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "HIV Prevention and Resistance": [
      {
        "stem": "Which drug regimen is standard for HIV pre-exposure prophylaxis (PrEP)?",
        "options": {
          "A": "Abacavir + lamivudine",
          "B": "Dolutegravir + lamivudine",
          "C": "Tenofovir + emtricitabine",
          "D": "Efavirenz + zidovudine",
          "E": "Maraviroc monotherapy"
        },
        "answer": "C",
        "rationales": {
          "C": "TDF/TAF + emtricitabine is standard PrEP.",
          "A": "Abacavir/lamivudine not used for PrEP.",
          "B": "Dolutegravir/lamivudine is ART, not PrEP.",
          "D": "Efavirenz regimens are outdated ART.",
          "E": "Maraviroc monotherapy ineffective."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which factor most contributes to HIV drug resistance development?",
        "options": {
          "A": "Starting ART at low CD4 count",
          "B": "High baseline viral load",
          "C": "Poor adherence to ART",
          "D": "Use of INSTI-based regimen",
          "E": "Pregnancy"
        },
        "answer": "C",
        "rationales": {
          "C": "Poor adherence allows viral replication under drug pressure, driving resistance.",
          "A": "Low CD4 = worse prognosis but not direct cause.",
          "B": "High load makes suppression harder but adherence is key.",
          "D": "INSTIs have high barrier to resistance.",
          "E": "Pregnancy does not cause resistance."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ]
  },
  "Non-HIV Anti-viral Agents (Fisher)": {
    "Anti-Herpesvirus Agents": [
      {
        "stem": "Which enzyme is inhibited by acyclovir after phosphorylation by viral thymidine kinase?",
        "options": {
          "A": "DNA polymerase",
          "B": "RNA polymerase",
          "C": "Reverse transcriptase",
          "D": "Topoisomerase",
          "E": "Integrase"
        },
        "answer": "A",
        "rationales": {
          "A": "Acyclovir inhibits viral DNA polymerase once phosphorylated by viral TK.",
          "B": "RNA polymerase is not its target.",
          "C": "Reverse transcriptase is for HIV.",
          "D": "Topoisomerase inhibitors are anticancer drugs.",
          "E": "Integrase inhibitors are for HIV."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which antiviral is the drug of choice for cytomegalovirus (CMV) infections?",
        "options": {
          "A": "Acyclovir",
          "B": "Valacyclovir",
          "C": "Ganciclovir",
          "D": "Foscarnet",
          "E": "Oseltamivir"
        },
        "answer": "C",
        "rationales": {
          "C": "Ganciclovir is the first-line treatment for CMV.",
          "A": "Acyclovir is less active against CMV.",
          "B": "Valacyclovir is an acyclovir prodrug, not CMV drug of choice.",
          "D": "Foscarnet is used for resistant CMV/HSV.",
          "E": "Oseltamivir is for influenza."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Anti-Influenza Agents": [
      {
        "stem": "Which influenza drug inhibits neuraminidase, preventing viral release?",
        "options": {
          "A": "Amantadine",
          "B": "Rimantadine",
          "C": "Oseltamivir",
          "D": "Favipiravir",
          "E": "Baloxavir"
        },
        "answer": "C",
        "rationales": {
          "C": "Oseltamivir (and zanamivir) are neuraminidase inhibitors.",
          "A": "Amantadine blocks M2 channel, now obsolete.",
          "B": "Rimantadine same as amantadine.",
          "D": "Favipiravir inhibits viral RNA polymerase.",
          "E": "Baloxavir inhibits cap-dependent endonuclease."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which influenza antiviral inhibits cap-dependent endonuclease activity?",
        "options": {
          "A": "Oseltamivir",
          "B": "Zanamivir",
          "C": "Baloxavir",
          "D": "Amantadine",
          "E": "Ribavirin"
        },
        "answer": "C",
        "rationales": {
          "C": "Baloxavir marboxil targets cap-dependent endonuclease, blocking viral mRNA synthesis.",
          "A": "Oseltamivir inhibits neuraminidase.",
          "B": "Zanamivir inhibits neuraminidase.",
          "D": "Amantadine blocks M2 channel.",
          "E": "Ribavirin is a guanosine analogue for RSV/HCV."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Anti-Hepatitis Agents": [
      {
        "stem": "Which antiviral regimen is most commonly used for chronic hepatitis C infection?",
        "options": {
          "A": "Lamivudine monotherapy",
          "B": "Tenofovir and entecavir",
          "C": "Direct-acting antivirals (DAAs) targeting NS5A/NS5B",
          "D": "Acyclovir and valacyclovir",
          "E": "Interferon-alpha only"
        },
        "answer": "C",
        "rationales": {
          "C": "Modern HCV therapy uses DAAs targeting NS5A and NS5B proteins.",
          "A": "Lamivudine is for HBV.",
          "B": "Tenofovir/entecavir = HBV therapy.",
          "D": "Acyclovir/valacyclovir are for HSV/VZV.",
          "E": "Interferon is outdated for HCV."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Which drug is a nucleos(t)ide analog active against hepatitis B virus?",
        "options": {
          "A": "Oseltamivir",
          "B": "Tenofovir",
          "C": "Baloxavir",
          "D": "Acyclovir",
          "E": "Foscarnet"
        },
        "answer": "B",
        "rationales": {
          "B": "Tenofovir is a nucleotide analog used for HBV (and HIV).",
          "A": "Oseltamivir = influenza.",
          "C": "Baloxavir = influenza.",
          "D": "Acyclovir = herpesviruses.",
          "E": "Foscarnet = resistant CMV/HSV."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ],
    "Other Antivirals": [
      {
        "stem": "Which antiviral is a guanosine analog used for RSV and some viral hemorrhagic fevers?",
        "options": {
          "A": "Oseltamivir",
          "B": "Acyclovir",
          "C": "Ribavirin",
          "D": "Baloxavir",
          "E": "Zanamivir"
        },
        "answer": "C",
        "rationales": {
          "C": "Ribavirin is a guanosine analog with broad antiviral activity.",
          "A": "Oseltamivir = influenza.",
          "B": "Acyclovir = HSV/VZV.",
          "D": "Baloxavir = influenza.",
          "E": "Zanamivir = influenza."
        },
        "difficulty": "Easy",
        "long_form": true
      },
      {
        "stem": "Foscarnet is reserved for resistant herpesvirus infections. What is its mechanism?",
        "options": {
          "A": "DNA polymerase inhibition without phosphorylation",
          "B": "RNA polymerase inhibition after phosphorylation",
          "C": "Reverse transcriptase inhibition requiring phosphorylation",
          "D": "Protease inhibition",
          "E": "Integrase inhibition"
        },
        "answer": "A",
        "rationales": {
          "A": "Foscarnet directly inhibits DNA polymerase without requiring phosphorylation.",
          "B": "RNA polymerase inhibition is not correct.",
          "C": "NRTIs need phosphorylation.",
          "D": "Protease inhibitors are for HIV.",
          "E": "Integrase inhibitors are for HIV."
        },
        "difficulty": "Medium",
        "long_form": true
      }
    ]
  }
}